[
  {
    "title": "Welcome - The Payne Principle",
    "content": [
      {
        "type": "paragraph",
        "text": "Imagine this: You&#x27;re on a bus one morning, on your way to work, when you discover that some nasty man with a grudge has rigged the bus to explode if it drops below 50 miles per hour."
      },
      {
        "type": "paragraph",
        "text": "Not a great way to start the day. Though perhaps a good way to meet your next romantic partner."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what happens to Annie Porter—played by Sandra Bullock—in the 1994 movie <em>Speed</em>. Keanu Reeves plays Jack Traven, an LAPD cop who commandeers a car, races through traffic, and jumps onto the moving bus to help. But when a panicked passenger sees Jack and pulls a gun, the driver gets shot. Annie takes the wheel. She&#x27;s petrified, but she keeps driving. She has no choice. If she slows down, everyone dies."
      },
      {
        "type": "paragraph",
        "text": "Together, Annie and Jack have to race through city streets, crash through barriers, and jump gaps in freeways. Always on the edge of disaster. Gotta keep the speed up, or we die. But the roads aren&#x27;t built for it."
      },
      {
        "type": "paragraph",
        "text": "You see this happening in software teams. Yes, even the good ones."
      },
      {
        "type": "paragraph",
        "text": "Leaders push their teams to go faster and faster—often by imposing productivity metrics and goals, their well-meaning equivalent of the bomb—and the teams start acting just like that bus. Racing ahead. Taking dangerous shortcuts. Cutting corners. Crashing into things."
      },
      {
        "type": "paragraph",
        "text": "Often, it&#x27;s because there are too many developers and not enough product or technical leaders to guide them. But you can&#x27;t slow down below 50! So the teams stay busy, moving fast, going nowhere."
      },
      {
        "type": "paragraph",
        "text": "The instinct is to add more power—more developers, more hours, more pressure. But that&#x27;s not how you make something go faster. You reshape it. Aerodynamics, not horsepower."
      },
      {
        "type": "paragraph",
        "text": "Near the end of the movie, the bus ends up at an airport. A wide-open space. No obstacles. They can finally drive without crashing into things."
      },
      {
        "type": "paragraph",
        "text": "Totally pointless."
      },
      {
        "type": "paragraph",
        "text": "They&#x27;re going around and around in circles. But there&#x27;s a bomb on board, so they&#x27;ve got to keep going fast."
      },
      {
        "type": "paragraph",
        "text": "Busy. Busy. Busy."
      },
      {
        "type": "paragraph",
        "text": "Then the bus—which has been burning fuel like crazy—starts to run out of fuel. Which makes it even more likely to crash and burn."
      },
      {
        "type": "paragraph",
        "text": "Burn out."
      },
      {
        "type": "paragraph",
        "text": "Speed kills."
      },
      {
        "type": "paragraph",
        "text": "I&#x27;m sure you&#x27;ve seen it: teams burn out, rack up technical debt, and ruin people&#x27;s family lives, all for the sake of speed that&#x27;s going nowhere, fast."
      },
      {
        "type": "paragraph",
        "text": "We&#x27;ve been there."
      },
      {
        "type": "paragraph",
        "text": "I call this the Payne Principle—named after the villain, Howard Payne, played by Dennis Hopper."
      },
      {
        "type": "paragraph",
        "text": "<strong>Going fast in the wrong direction is not going fast at all.</strong>"
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s just burning fuel."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Here are the key lessons of this book:"
      },
      {
        "type": "paragraph",
        "text": "1.\tEvery software team has a bottleneck—that’s just a fact."
      },
      {
        "type": "paragraph",
        "text": "2.\tEvery software team should have one bottleneck, in one specific place, as a deliberate strategic choice."
      },
      {
        "type": "paragraph",
        "text": "3.\tIf the bottleneck is anywhere else—which it usually is—your teams will be very busy, very stressed, and very sluggish. They will spend most of their days playing whack-a-mole with bottlenecks that keep popping up all over the place."
      },
      {
        "type": "paragraph",
        "text": "The fastest, most productive Agile teams are shaped like an hourglass—with the bottleneck in the middle."
      },
      {
        "type": "paragraph",
        "text": "They choose one strategic bottleneck rather than many random bottlenecks."
      },
      {
        "type": "paragraph",
        "text": "Aerodynamics over bombs."
      },
      {
        "type": "paragraph",
        "text": "Calm over chaos."
      },
      {
        "type": "paragraph",
        "text": "If you&#x27;ve studied <em>Bottleneck Thinking</em>, you&#x27;ve been trained to <em>find</em>. This book says: Stop finding. Start choosing."
      },
      {
        "type": "paragraph",
        "text": "I call them Timer Teams. (An hourglass-shaped team where developers are the deliberate bottleneck, supported by slack upstream and downstream.)"
      },
      {
        "type": "paragraph",
        "text": "They’re fast, productive, and surprisingly calm. And so, so much fun to work in."
      },
      {
        "type": "paragraph",
        "text": "<strong>•\tPart 1:</strong> What are Timer Teams?"
      },
      {
        "type": "paragraph",
        "text": "<strong>•\tPart 2:</strong> How do we create, protect, and grow them?"
      },
      {
        "type": "paragraph",
        "text": "<strong>•\tPart 3:</strong> The People Who Make Teams Work"
      },
      {
        "type": "paragraph",
        "text": "<strong>•\tPart 4:</strong> When the Bottleneck Is at the Top"
      },
      {
        "type": "paragraph",
        "text": "<strong>•\tAfterword:</strong> Eve&#x27;s Story (Some say it&#x27;s the best part of the book.)"
      },
      {
        "type": "paragraph",
        "text": "One more thing. This book explains Timer Teams first—that&#x27;s the clearest way to teach it. But when I help organizations implement this? We often need to start at the top. Debottleneck the leaders, then they set up the Timer Teams. You&#x27;ll see why in Part 4."
      },
      {
        "type": "paragraph",
        "text": "Now, let&#x27;s get moving."
      }
    ]
  },
  {
    "title": "Part 1: Timer Teams",
    "content": []
  },
  {
    "title": "Chapter 1: What’s the Right Number of Testers?",
    "content": [
      {
        "type": "paragraph",
        "text": "My story starts about fifteen years ago. I was in a creaky, old meeting room, just off the old town in Edinburgh, helping a manager called Rosie put together her first Agile team. This was a brand-new product."
      },
      {
        "type": "paragraph",
        "text": "She asked me, “How many testers do we need?”"
      },
      {
        "type": "paragraph",
        "text": "I said, “Umm. How many do you think?”"
      },
      {
        "type": "paragraph",
        "text": "She said, “I don’t know. I’ve never worked with Agile teams before, and in the past, we always did our testing after most of the coding was done. But now that we’re coding and testing at the same time …” She shrugged. “I’ve no idea how many people we need.”"
      },
      {
        "type": "paragraph",
        "text": "I nodded."
      },
      {
        "type": "paragraph",
        "text": "“And we’re going to have some automated tests too, so they’re like robot testers, but the testers still have to help set them up. Right?”"
      },
      {
        "type": "paragraph",
        "text": "“Right.”"
      },
      {
        "type": "paragraph",
        "text": "She looked at me. “So what’s the answer?”"
      },
      {
        "type": "paragraph",
        "text": "I said, “How many developers do you have?”"
      },
      {
        "type": "paragraph",
        "text": "“Twelve. Plus a lead developer.”"
      },
      {
        "type": "paragraph",
        "text": "I said, “In my last job at a famous, massive international company—one that employed roughly 15,000 programmers—we had a rule that you had to have one tester for every three developers.”"
      },
      {
        "type": "paragraph",
        "text": "“So we need four testers for twelve developers,” she said."
      },
      {
        "type": "paragraph",
        "text": "“Maybe. Maybe more. Maybe less. That was a rule of thumb, and it never worked perfectly. We found that in some teams, that was too many testers. And in others, it was too few. Sometimes it was a Goldilocks ratio—just right.”"
      },
      {
        "type": "paragraph",
        "text": "“Hmmm,” she said. “That’s not helpful.”"
      },
      {
        "type": "paragraph",
        "text": "I said, “You’re hiring a mix of employees and contract freelancer testers, right?”"
      },
      {
        "type": "paragraph",
        "text": "“Yep.”"
      },
      {
        "type": "paragraph",
        "text": "“So here’s a better rule: Hire one or even two testers more than you think you need. If that’s too many, you can let one go at the end of their contract term. And if it’s too few, you’ll soon know, and you can hire more.”"
      },
      {
        "type": "paragraph",
        "text": "She frowned. “I don’t like the idea of hiring too many people. It’s a waste of money.”"
      },
      {
        "type": "paragraph",
        "text": "“Compared to what?”"
      },
      {
        "type": "paragraph",
        "text": "“What do you mean?”"
      },
      {
        "type": "paragraph",
        "text": "“What does it cost to hire one extra tester for three months?”"
      },
      {
        "type": "paragraph",
        "text": "She said a number. Let’s say it was £25,000—the currency doesn’t matter, nor does the amount."
      },
      {
        "type": "paragraph",
        "text": "I said, “Do you know how much money the company loses if it’s a month late?”"
      },
      {
        "type": "paragraph",
        "text": "She said, “The cost of delay? I’ve been reading about that.” She thought a moment. “I’ve no idea. No one has ever said.”"
      },
      {
        "type": "paragraph",
        "text": "I said, “The project sponsor told me it was £1.9 million a month. Roughly.”"
      },
      {
        "type": "paragraph",
        "text": "“Oh.”"
      },
      {
        "type": "paragraph",
        "text": "“Yeah.”"
      },
      {
        "type": "paragraph",
        "text": "“So 25k is peanuts. A mere rounding error in the bigger picture,” she said."
      },
      {
        "type": "paragraph",
        "text": "“If you don’t have enough testers, then your entire team will run too slow, and your project will easily be delayed by a month. That’s a very expensive and costly mistake.”"
      },
      {
        "type": "paragraph",
        "text": "“Very.” She paused. “But how will I know if I’ve hired enough testers?”"
      },
      {
        "type": "paragraph",
        "text": "I said, “What do you think happens if you don’t have enough testers?”"
      },
      {
        "type": "paragraph",
        "text": "She thought a moment. “The testers will take too long to test.”"
      },
      {
        "type": "paragraph",
        "text": "“And then?”"
      },
      {
        "type": "paragraph",
        "text": "“The developers won’t get feedback fast enough.” She frowned. “They won’t wait around, will they? They’ll start working on new stuff.”"
      },
      {
        "type": "paragraph",
        "text": "I nodded. “So work in progress …”"
      },
      {
        "type": "paragraph",
        "text": "“Shoots up.” She was getting it now. “And when the bugs finally come back, the developers will have moved on. They’ll be working on something else entirely. The bug will be for code they wrote days ago.”"
      },
      {
        "type": "paragraph",
        "text": "“Which means?”"
      },
      {
        "type": "paragraph",
        "text": "“Harder to fix. Slower.” She sat back. “The whole team slows down because we didn’t have enough testers.”"
      },
      {
        "type": "paragraph",
        "text": "I knew she’d just completed some Agile training, and what she’d described were two of its fundamental rules."
      },
      {
        "type": "paragraph",
        "text": "I said, “Developers need fast feedback from testers, right?”"
      },
      {
        "type": "paragraph",
        "text": "She nodded."
      },
      {
        "type": "paragraph",
        "text": "“And teams need to keep work in progress low, right?”"
      },
      {
        "type": "paragraph",
        "text": "She nodded again."
      },
      {
        "type": "paragraph",
        "text": "I said, “Fast teams obey those rules. Slow teams don’t.”"
      },
      {
        "type": "paragraph",
        "text": "She nodded slowly, thinking. “So, you’re saying that the number of testers we hire determines whether we can obey both rules, or not.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly. So the rule of thumb for testers is?”"
      },
      {
        "type": "paragraph",
        "text": "She thought a moment. “Can they give fast feedback?”"
      },
      {
        "type": "paragraph",
        "text": "“That’s it. If they can, you’ve probably got enough. If they can’t, you need more.”"
      },
      {
        "type": "paragraph",
        "text": "She nodded, slowly, as if banking that thought in her mind."
      },
      {
        "type": "paragraph",
        "text": "I said, “And the cost of not having enough?”"
      },
      {
        "type": "paragraph",
        "text": "“The whole team slows down. Developers either wait or don’t wait, and either way, they make things worse. Either way, you’re late. And late is expensive.”"
      }
    ]
  },
  {
    "title": "Chapter 2: What’s the Right Number of Product People?",
    "content": [
      {
        "type": "paragraph",
        "text": "Rosie thought for a moment."
      },
      {
        "type": "paragraph",
        "text": "“All right, so we’ve got twelve developers. And six testers. How many product analysts do I need?”"
      },
      {
        "type": "paragraph",
        "text": "I said nothing."
      },
      {
        "type": "paragraph",
        "text": "She said, “I take it there’s no ratio for this question either.”"
      },
      {
        "type": "paragraph",
        "text": "“No.”"
      },
      {
        "type": "paragraph",
        "text": "“And we can’t use the same rule of thumb, can we? Because it doesn’t make sense.”"
      },
      {
        "type": "paragraph",
        "text": "“No.”"
      },
      {
        "type": "paragraph",
        "text": "She paused. “But I’m guessing that we need to use a variation on that rule of thumb. We need enough people working upstream of the developers so that we don’t starve them of work.”"
      },
      {
        "type": "paragraph",
        "text": "“Yes. And also—you have enough that the developers are always working on high-quality inputs. And high-value inputs.”"
      },
      {
        "type": "paragraph",
        "text": "“Okay.”"
      },
      {
        "type": "paragraph",
        "text": "“If the testers&#x27; rule of thumb is that you need enough testers so they can give quick feedback, the equivalent for the product people—analysts, product managers, or whatever you call them—is that they have time to think.”"
      },
      {
        "type": "paragraph",
        "text": "“Time to think,” she repeated."
      },
      {
        "type": "paragraph",
        "text": "“They need time to think without cutting corners,” I said. “It’s true that a lot of what they do will be collaborative—working alongside developers and testers. But that only works well if they actually have time to do it properly.”"
      },
      {
        "type": "paragraph",
        "text": "“Right.”"
      },
      {
        "type": "paragraph",
        "text": "“If they’re rushed because there aren’t enough of them, and they’re trying to keep twelve developers and six testers busy, they’ll feel under pressure to cut corners. And it’s not just that they’ll feel the pressure—they’ll be put under pressure. You can’t leave seventeen people sitting idle because they haven’t got work to do. It’s just not palatable.”"
      },
      {
        "type": "paragraph",
        "text": "Rosie nodded. “Yeah, I get that. And there’s no way that the developers would just sit there waiting anyway. They’d invent work. Or grab something that’s only half-ready and start working on it—then spend ages reworking it later.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly. That’s why we need enough product analysts so that they have time to think. Without cutting corners.”"
      },
      {
        "type": "paragraph",
        "text": "“Okay,” she said. “But what happens when they do cut corners? What does that actually look like?”"
      },
      {
        "type": "paragraph",
        "text": "I said, “If they’re rushed, they’ll cut corners. Hand work over before it’s ready. Make choices they wouldn’t make if they had more time.”"
      },
      {
        "type": "paragraph",
        "text": "“And then the developers build the wrong thing?”"
      },
      {
        "type": "paragraph",
        "text": "“Or they build it, and it has to be rebuilt. Or they get stuck waiting for clarification. Either way—rework. And rework is expensive.”"
      },
      {
        "type": "paragraph",
        "text": "She nodded. “It’s like that old saying that carpenters use: <em>Measure twice, cut once</em>.”"
      },
      {
        "type": "paragraph",
        "text": "“Sort of. Developers cut code, but it’s not like cutting wood. You can’t get everything right up front—and you shouldn’t try. Some things only become clear once you start building. That’s discovery. Collaboration. That’s healthy.”"
      },
      {
        "type": "paragraph",
        "text": "“So it’s not about getting everything perfect.”"
      },
      {
        "type": "paragraph",
        "text": "“No. It’s about having enough time to think things through—so you avoid the expensive rework. The rework that didn’t need to happen.”"
      },
      {
        "type": "paragraph",
        "text": "She frowned. “When they’re under pressure, do analysts know they’re cutting corners?”"
      },
      {
        "type": "paragraph",
        "text": "Now, it was my time to think. I’d never considered this question before. I said, “Usually not. And if they do know—deep down—they’re too busy to do anything about it. They just push on and resent it.”"
      },
      {
        "type": "paragraph",
        "text": "Rosie sat with that for a moment."
      },
      {
        "type": "paragraph",
        "text": "“So the rule of thumb for product people is: Do they have time to think?”"
      },
      {
        "type": "paragraph",
        "text": "I nodded. “Yes. If they’re rushing, you probably don’t have enough of them.”"
      },
      {
        "type": "paragraph",
        "text": "“And the cost of not having enough?”"
      },
      {
        "type": "paragraph",
        "text": "“The whole team slows down. Or worse—they stay busy, but on the wrong things.”"
      }
    ]
  },
  {
    "title": "Chapter 3: Timer Teams",
    "content": [
      {
        "type": "paragraph",
        "text": "Over time, I&#x27;ve come to realize that these two simple rules are almost universal. And almost universally ignored."
      },
      {
        "type": "paragraph",
        "text": "If you want your team to go fast—in the right direction—it needs to be shaped like an hourglass."
      },
      {
        "type": "paragraph",
        "text": "I call these Timer Teams."
      },
      {
        "type": "image",
        "src": "books/speed-book/images/rId3.png"
      },
      {
        "type": "paragraph",
        "text": "The hourglass is how you spot one. The name is how you talk about it."
      },
      {
        "type": "paragraph",
        "text": "At the top of the hourglass are the <em>upstream roles</em>—the people who figure out what to build. Analysts, product managers, UX designers, and architects. Their job is thinking."
      },
      {
        "type": "paragraph",
        "text": "At the bottom are the <em>downstream roles</em>—the people who confirm that what was built actually works. Testers, QA engineers, and automation specialists. Their job is feedback."
      },
      {
        "type": "paragraph",
        "text": "And in the narrow neck, the developers. They turn thinking into software."
      },
      {
        "type": "paragraph",
        "text": "Sand mostly flows one way—from thinking, through coding, to feedback."
      },
      {
        "type": "paragraph",
        "text": "If the top hourglass bulb is too small, the neck starves. Developers run out of good work or grab half-baked work and pay for it later."
      },
      {
        "type": "paragraph",
        "text": "If the bottom hourglass bulb is too small, the neck clogs up like a shower drain pipe —ugh. Developers finish work but don&#x27;t get feedback. They move on to new things. Work in progress piles up. Bugs get discovered late, when they&#x27;re expensive to fix."
      },
      {
        "type": "paragraph",
        "text": "But sand doesn&#x27;t only flow forward."
      },
      {
        "type": "paragraph",
        "text": "When things go wrong, it flows backward. Bugs go back to developers. Misunderstandings go back to the analysts. Avoidable rework piles up in the top bulb, waiting to be fixed."
      },
      {
        "type": "paragraph",
        "text": "In an unhealthy team, that top bulb fills with bad sand: rushed work, low-value work, and rework."
      },
      {
        "type": "paragraph",
        "text": "Some rework is healthy—that&#x27;s learning, discovery, and collaboration. But a team whose backlog is full of bugs, preventable changes, and rework? They&#x27;re busy fixing stuff, not being productive. That&#x27;s a broken hourglass."
      },
      {
        "type": "paragraph",
        "text": "Good news: Agile teams already have a way to see this. They call it the product backlog."
      },
      {
        "type": "paragraph",
        "text": "The backlog is the sand sitting in the top bulb of the hourglass. In a healthy team, it’s good sand: well thought out, prepared, and ready to flow through the neck."
      },
      {
        "type": "paragraph",
        "text": "The backlog tells you two things."
      },
      {
        "type": "paragraph",
        "text": "First, quantity. If there&#x27;s enough sand up top—enough work ready, but not a crazy amount—your analysts clearly have enough capacity to keep your developers fed. That&#x27;s what you want. If the top bulb keeps running empty, your analysts can&#x27;t keep up. They&#x27;re the bottleneck now."
      },
      {
        "type": "paragraph",
        "text": "Second, quality. If work keeps coming back as rework—bugs, misunderstandings, and changes that could have been avoided—that&#x27;s a sign your analysts are rushing. They&#x27;re keeping up in volume but cutting corners. They don&#x27;t have time to think."
      },
      {
        "type": "paragraph",
        "text": "Either signal often means the same thing: you don&#x27;t have enough upstream capacity."
      },
      {
        "type": "paragraph",
        "text": "Two rules of thumb:"
      },
      {
        "type": "paragraph",
        "text": "<strong>1.\tUpstream:</strong> Do your product people have time to think—without cutting corners?"
      },
      {
        "type": "paragraph",
        "text": "<strong>2.\tDownstream:  </strong>Are your testers able to give fast feedback?"
      },
      {
        "type": "paragraph",
        "text": "If the answer to both is yes, your team is probably shaped right."
      },
      {
        "type": "paragraph",
        "text": "This means some people won&#x27;t be fully occupied. That&#x27;s not waste. It&#x27;s thinking time upstream. Fast feedback downstream. It&#x27;s speed and profit—just stored in a different form."
      },
      {
        "type": "paragraph",
        "text": "This is what aerodynamic looks like. No drag. Shaped for speed."
      },
      {
        "type": "paragraph",
        "text": "Let me show you what I mean."
      }
    ]
  },
  {
    "title": "Chapter 4: The Smiley Face",
    "content": [
      {
        "type": "paragraph",
        "text": "A few years after my conversation with Rosie, I began discussing these ideas at conferences. I called them U-shaped teams back then—because of how they look on a graph. You&#x27;ll see what I mean in a moment."
      },
      {
        "type": "paragraph",
        "text": "At one conference, a guy I&#x27;ll call Tim pinged me after my talk."
      },
      {
        "type": "paragraph",
        "text": "“Hey, Clarke, could I buy you breakfast? I couldn&#x27;t come to your talk yesterday—I attended another session. But my boss said it was a real shame that I missed it. Any chance you could give me the ten-minute version?”"
      },
      {
        "type": "paragraph",
        "text": "Breakfast was included with the conference, but hey, I like talking about this stuff."
      },
      {
        "type": "paragraph",
        "text": "So I told him the Rosie story. Testers need enough capacity to give fast feedback. Analysts need enough capacity to think without cutting corners. And the developers—they&#x27;re the bottleneck. The scarcest resource."
      },
      {
        "type": "paragraph",
        "text": "Then I showed him two charts."
      },
      {
        "type": "paragraph",
        "text": "The first was a simple bar chart—absolute numbers—how many people in each role. Three analysts, twelve developers, and six testers."
      },
      {
        "type": "image",
        "src": "books/speed-book/images/rId4.png"
      },
      {
        "type": "paragraph",
        "text": "Absolute Capacity - hides the bottleneck."
      },
      {
        "type": "paragraph",
        "text": "The second was different. It showed relative capacity—how much slack each role has compared to the bottleneck."
      },
      {
        "type": "image",
        "src": "books/speed-book/images/rId5.png"
      },
      {
        "type": "paragraph",
        "text": "Relative Capacity - reveals the bottleneck."
      },
      {
        "type": "paragraph",
        "text": "“Picture it like this,” I said. “Analysts on the left, developers in the middle, and testers on the right. Relative capacity on the vertical axis. What shape do you get?”"
      },
      {
        "type": "paragraph",
        "text": "He thought for a moment. “A U-shape. Developers are in the middle, at the bottom. Everyone else is higher.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly. The developers are the bottleneck. Everyone else has slack—room to respond quickly when the developers need them. That&#x27;s what makes the team fast.”"
      },
      {
        "type": "paragraph",
        "text": "Tim stared at the chart."
      },
      {
        "type": "paragraph",
        "text": "“Oh, wow,” he said. “I think I see why my boss wanted me to talk to you.”"
      },
      {
        "type": "paragraph",
        "text": "“Why&#x27;s that?”"
      },
      {
        "type": "paragraph",
        "text": "“I&#x27;ve got a U-shaped team right now. It works well. But I&#x27;ve just got a budget from my boss to hire three new developers.”"
      },
      {
        "type": "paragraph",
        "text": "“And?”"
      },
      {
        "type": "paragraph",
        "text": "“That&#x27;s going to flip the shape. The developers won&#x27;t be at the bottom any longer. The testers will be. Or the analysts. Or both.”"
      },
      {
        "type": "paragraph",
        "text": "He grabbed a napkin and sketched it out."
      },
      {
        "type": "paragraph",
        "text": "Then he smiled and said, “The U-shape looks like a smiley face.”"
      },
      {
        "type": "paragraph",
        "text": "I smiled back. I’d never noticed that."
      },
      {
        "type": "paragraph",
        "text": "He said, “But if I hire three developers and no one else … it will flip upside down and be N-shaped.”"
      },
      {
        "type": "paragraph",
        "text": "I nodded."
      },
      {
        "type": "paragraph",
        "text": "He said, “It will turn into a frown.”"
      },
      {
        "type": "image",
        "src": "books/speed-book/images/rId6.png"
      },
      {
        "type": "paragraph",
        "text": "He paused, then frowned, thinking this through. “I think maybe I need to hire one developer, one analyst, and one tester instead.”"
      },
      {
        "type": "paragraph",
        "text": "“That&#x27;s one option,” I said. “Or you could hire one developer who is good at writing automated tests. That way, you&#x27;re building test capacity at the same time.”"
      },
      {
        "type": "paragraph",
        "text": "“And, and, and,” he said, thinking out loud. “You know what, Clarke? I bet I could persuade one of our operational staff—Maria—to come join us, and we could train her up to be an analyst. She already works with us a lot as our subject-matter expert, and she helps out with user acceptance testing. She’d be perfect.”"
      },
      {
        "type": "paragraph",
        "text": "He looked down at his hands, then looked back up at me. “That’s what I’ll do. I like my smiley-face team, and I’d like to keep it that way.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Tim didn&#x27;t hire those three developers. He kept the hourglass shape."
      },
      {
        "type": "paragraph",
        "text": "But what if he had?"
      }
    ]
  },
  {
    "title": "Chapter 5: The Frown",
    "content": [
      {
        "type": "paragraph",
        "text": "What I’m about to say is counterintuitive."
      },
      {
        "type": "paragraph",
        "text": "Everyone’s intuition says: If you want the team to go faster, hire more developers."
      },
      {
        "type": "paragraph",
        "text": "It’s obvious, right? Developers write the code. More developers, more code, and faster delivery."
      },
      {
        "type": "paragraph",
        "text": "It’s like thinking that, if you want your car to go faster, you add a turbocharger or buy a bigger engine. Which sounds sensible—until you realize that most cars would go faster if you just changed the traffic systems so there was less queuing at traffic lights."
      },
      {
        "type": "paragraph",
        "text": "In <em>Bottleneck Thinking</em>—my specialty—the answer is: Almost never ‘hire more developers.&#x27; It&#x27;s &#x27;reshape the team around the developers you already have.&#x27;"
      },
      {
        "type": "paragraph",
        "text": "Tim’s story shows how easy it is to get this wrong."
      },
      {
        "type": "paragraph",
        "text": "His team had seven developers, two analysts, and two testers. The testers were experienced, and they’d built up a good suite of automated tests—so his testing capacity was stronger than the headcount suggested."
      },
      {
        "type": "paragraph",
        "text": "It was a U-shaped team. Developers at the bottom. Smiley face."
      },
      {
        "type": "paragraph",
        "text": "Tim was happy. Work flowed through the system without being blocked. No one felt under pressure to cut corners."
      },
      {
        "type": "paragraph",
        "text": "Now imagine he’d hired those three new developers. His team would have gone from seven developers to ten. But still two analysts. Still two testers."
      },
      {
        "type": "paragraph",
        "text": "What happens next?"
      },
      {
        "type": "paragraph",
        "text": "His boss would expect those ten developers to be busy. Can you imagine how she’d react if Tim hired three new developers and they were sitting around waiting for work? She wouldn’t be happy."
      },
      {
        "type": "paragraph",
        "text": "So Tim would go scrambling to make sure the analysts could feed them enough work. And the testers would be scrambling to keep up with the output."
      },
      {
        "type": "paragraph",
        "text": "When you flip the shape, you&#x27;re running at the speed of the fastest, not the slowest. No one else can keep up. They cut corners, create costly, wasteful (and often invisible) rework. And bottlenecks? They pop up everywhere. When you run at the speed of the fastest, you turn everyone into a bottleneck."
      },
      {
        "type": "paragraph",
        "text": "When analysts are under pressure, three things happen."
      },
      {
        "type": "heading2",
        "text": "First, They Rush the Thinking"
      },
      {
        "type": "paragraph",
        "text": "Picture one of Tim’s analysts—let’s call her Sarah. She thinks of herself as a craftswoman. She takes pride in her work."
      },
      {
        "type": "paragraph",
        "text": "She’s working on a new feature. It’s on her screen, and she’s thinking it through. There are some edge cases she hasn’t fully explored yet. She knows she should spend another day or two digging into them, making sure she’s got it right."
      },
      {
        "type": "paragraph",
        "text": "But the developers keep asking: “Is there anything ready for us to pick up?”"
      },
      {
        "type": "paragraph",
        "text": "She looks at the feature spec on her screen. It’s not quite ready."
      },
      {
        "type": "paragraph",
        "text": "But it’s close enough, right?"
      },
      {
        "type": "paragraph",
        "text": "No. But she hands it over anyway."
      },
      {
        "type": "paragraph",
        "text": "The developers start working on it. She hopes that, if the edge cases are wrong, they’ll come back and ask. She can fix them up later. The immediate pressure is off."
      },
      {
        "type": "paragraph",
        "text": "But she’s traded that pressure for expensive rework down the line. The developers will hit problems. They’ll get stuck. They’ll build something that needs to be rebuilt. Fixing it later always takes longer than getting it right the first time."
      },
      {
        "type": "paragraph",
        "text": "Sarah knows this. Half-baked work is like a half-baked chicken pie—someone’s going to get food poisoning. She handed it over anyway."
      },
      {
        "type": "heading2",
        "text": "Second, They Miss Opportunities to Simplify"
      },
      {
        "type": "paragraph",
        "text": "Picture Sam, Tim’s other analyst. She’s been wrestling with a tricky feature for a few days. She’s climbed the mountain of complexity—built something big, detailed, and complete. It works. But it’s confusing."
      },
      {
        "type": "paragraph",
        "text": "She’s reached what looks like the top. But it’s a false summit. The real peak—simplicity—is still ahead. Another day or two or three of hard climbing to push through the complexity, strip it back, and make it elegant."
      },
      {
        "type": "paragraph",
        "text": "But the developers are waiting. Her inbox is filling up with questions about when they can start."
      },
      {
        "type": "paragraph",
        "text": "She looks at her solution. It’s clever. It covers all the cases. But it’s complicated, and she knows it."
      },
      {
        "type": "paragraph",
        "text": "The pressure is on."
      },
      {
        "type": "paragraph",
        "text": "She hands it over."
      },
      {
        "type": "paragraph",
        "text": "The developers thank her for her hard work. They admire how thorough it is. How meaty and complicated and clever. This will be fun to work on."
      },
      {
        "type": "paragraph",
        "text": "They start building."
      },
      {
        "type": "paragraph",
        "text": "And because it’s complicated, it takes far longer to build than the simple solution they never saw. The testers struggle to understand it. Bugs hide in the confusion. And for years afterward—for the entire life of that software—everyone who touches it will spend more effort than they needed to."
      },
      {
        "type": "paragraph",
        "text": "The best analysts know the difference between the false summit—Peak Complicated—and Peak Simplicity. They know to keep climbing. But Sam didn’t have time. She stopped where she was, turned around, and started on the next feature."
      },
      {
        "type": "heading2",
        "text": "Third, They Cherry-Pick Easy Work"
      },
      {
        "type": "paragraph",
        "text": "Tim, Sarah, and Sam grab lunch from the vending machine. They don’t have time for anything else."
      },
      {
        "type": "paragraph",
        "text": "Then they head into a meeting room. The developers have run out of work. Again."
      },
      {
        "type": "paragraph",
        "text": "They pull up the product backlog—the list of features and improvements, prioritized by business value."
      },
      {
        "type": "paragraph",
        "text": "The top three items are all high value. But they all require days of thinking from Sarah and Sam. And if they do their job right—thorough analysis, simple solutions—each one might only keep the developers busy for a week or two."
      },
      {
        "type": "paragraph",
        "text": "That won’t solve the problem. The developers will be hungry again in no time."
      },
      {
        "type": "paragraph",
        "text": "So they scroll down the backlog. Past item 4. Past item 10. Past item 15."
      },
      {
        "type": "paragraph",
        "text": "At position 19, they find something interesting. Two days of analyst work. Three to six weeks of developer work."
      },
      {
        "type": "paragraph",
        "text": "Tim looks at Sarah. Sarah looks at Sam."
      },
      {
        "type": "paragraph",
        "text": "“It’s on the backlog,” someone says. “It’s not like we’re inventing work.”"
      },
      {
        "type": "paragraph",
        "text": "They’re right. It is on the backlog. It is valuable."
      },
      {
        "type": "paragraph",
        "text": "But it’s not the most valuable thing they could be doing. They’ve traded a high-value feature for a medium-value one—because the medium-value one was easier to prepare."
      },
      {
        "type": "paragraph",
        "text": "The team stays busy. The pressure eases. But the business doesn’t get what it needed most."
      },
      {
        "type": "paragraph",
        "text": "Not unlike eating vending machine junk food because you’re too busy to prepare something more nourishing."
      },
      {
        "type": "paragraph",
        "text": "You’ve probably been in this meeting. We all have."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The entire team is busy. Very busy. So much work to do. So much rework. But it’s not fast."
      },
      {
        "type": "paragraph",
        "text": "It’s the bus from <em>Speed</em> again—racing around the airport, burning fuel, and going nowhere fast."
      },
      {
        "type": "paragraph",
        "text": "It’s a good thing Tim didn’t hire three developers."
      },
      {
        "type": "paragraph",
        "text": "He kept his quiet, calm, and hyperproductive Timer Team.​​​​​​​​​​​​​​​​"
      },
      {
        "type": "paragraph",
        "text": "<em>That time.</em>"
      }
    ]
  },
  {
    "title": "Chapter 6: Flipping the Frown",
    "content": [
      {
        "type": "paragraph",
        "text": "About eighteen months after that breakfast, Tim called me."
      },
      {
        "type": "paragraph",
        "text": "“I&#x27;ve done something stupid,” he said."
      },
      {
        "type": "paragraph",
        "text": "“Go on.”"
      },
      {
        "type": "paragraph",
        "text": "“Remember our conversation about Timer Teams?”"
      },
      {
        "type": "paragraph",
        "text": "“Yeah, I remember. You didn&#x27;t hire those three developers. You kept the shape.”"
      },
      {
        "type": "paragraph",
        "text": "“Yeah, and that worked well.” He sighed. “But somehow, I forgot everything we talked about, and six months ago, I hired more developers, and I flipped the team.”"
      },
      {
        "type": "paragraph",
        "text": "He explained. His team had been humming along nicely. Smiley face intact. Then his boss got excited about a new initiative and gave him a budget for four more developers."
      },
      {
        "type": "paragraph",
        "text": "“It kinda felt wrong at the time, but I couldn’t explain why,” he said. “But it&#x27;s hard to turn down headcount. And we received some excellent resumes. So I hired them.”"
      },
      {
        "type": "paragraph",
        "text": "“And … how’s that going?”"
      },
      {
        "type": "paragraph",
        "text": "“Terribly. Everything&#x27;s slowed down. My analysts, Sam and Sarah, can&#x27;t keep up—they&#x27;re rushing stuff out half-baked. The testers are drowning in bugs. We&#x27;ve got developers sitting in stand-ups asking, “Is there anything ready for us to pick up?” and the answer is always “not quite.”"
      },
      {
        "type": "paragraph",
        "text": "“You broke your Timer Team.”"
      },
      {
        "type": "paragraph",
        "text": "“I broke it.”"
      },
      {
        "type": "paragraph",
        "text": "“It happens. It always feels like the obvious move.”"
      },
      {
        "type": "paragraph",
        "text": "“So what do I do? I can&#x27;t exactly fire the developers I just hired.”"
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s a fair question. And the logical answer—just stop the developers from working so much—sounds sensible, but never works."
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s like asking Annie to slow the bus down, and asking the bomb—very nicely—not to explode."
      },
      {
        "type": "paragraph",
        "text": "I&#x27;ve never found a way to make developers idle for more than a couple of days. It&#x27;s not in their nature. And their managers won&#x27;t stand for it."
      },
      {
        "type": "paragraph",
        "text": "So we need to be cleverer than that."
      },
      {
        "type": "paragraph",
        "text": "“Is there any work your developers could do that doesn&#x27;t need much analysis or testing time?”"
      },
      {
        "type": "paragraph",
        "text": "He paused. “That&#x27;s a good question. I hadn&#x27;t thought about it.”"
      },
      {
        "type": "paragraph",
        "text": "Another pause. “Actually … maybe. We&#x27;ve got a backlog of technical debt. Refactoring. Performance improvements. Stuff that doesn&#x27;t need much analysis or testing.”"
      },
      {
        "type": "paragraph",
        "text": "“Great,” I said. “Tim, have any of your developers been around long enough that they&#x27;ve got good product knowledge?”"
      },
      {
        "type": "paragraph",
        "text": "“A few. Marcus has been here for five years. He knows the system better than anyone.”"
      },
      {
        "type": "paragraph",
        "text": "“Better than Sam and Sarah?”"
      },
      {
        "type": "paragraph",
        "text": "“In some areas, yes.”"
      },
      {
        "type": "paragraph",
        "text": "“What&#x27;s stopping him from helping them?”"
      },
      {
        "type": "paragraph",
        "text": "“He&#x27;s too busy.”"
      },
      {
        "type": "paragraph",
        "text": "I said nothing. I knew what was coming."
      },
      {
        "type": "paragraph",
        "text": "“Too busy coding,” Tim said, “which is the problem, right?”"
      },
      {
        "type": "paragraph",
        "text": "I said, “What if Marcus spent two or three days a week working with the analysts? Not doing their job—helping them. Thinking through edge cases. Spotting technical landmines before they&#x27;re in the spec. Sitting in on conversations with users.”"
      },
      {
        "type": "paragraph",
        "text": "“He&#x27;d probably love that, actually. He&#x27;s always complaining that he finds out about requirements too late.”"
      },
      {
        "type": "paragraph",
        "text": "“There you go. You&#x27;re not losing a developer. You&#x27;re gaining analyst capacity—using someone who already knows the product.”"
      },
      {
        "type": "paragraph",
        "text": "Tim was quiet for a moment. “What about my testers? They&#x27;re overwhelmed.”"
      },
      {
        "type": "paragraph",
        "text": "“How so?”"
      },
      {
        "type": "paragraph",
        "text": "“There’s just far too much for them to test. And since some of Sam and Sarah’s work has been half-baked, they’re finding a lot of bugs, which is causing them a lot of admin and retesting. Our quality used to be much better.”"
      },
      {
        "type": "paragraph",
        "text": "I said, “This is a silly question, but I don’t suppose you have any developers who love testing?”"
      },
      {
        "type": "paragraph",
        "text": "He laughed. “No, and even if we did, we wouldn’t let them—they’re not good at it, and they moan a lot.”"
      },
      {
        "type": "paragraph",
        "text": "I said, “Developers are good at automating stuff. Could some of them automate more tests and build up testing capacity that way? Or, could they automate setting up test data? There must be ways the developers can help the testers, without actually doing manual testing.”"
      },
      {
        "type": "paragraph",
        "text": "“I don’t know.” Another pause. “I need to talk to my team. Ask them. They&#x27;ll have much better ideas I haven&#x27;t thought of.”"
      },
      {
        "type": "paragraph",
        "text": "He was right. Every team is different. The principle is the same—use your excess capacity to support your bottleneck—but the specifics? His team would know better than either of us."
      }
    ]
  },
  {
    "title": "Part 2: Protect, Grow, and Look Wider",
    "content": []
  },
  {
    "title": "Chapter 7: When Users Can&#x27;t Keep Up",
    "content": [
      {
        "type": "paragraph",
        "text": "So far, we&#x27;ve looked at the flow of work through the team. Product analysts upstream, feeding the developers. Testers downstream, giving fast feedback. The hourglass shape. The Timer Team."
      },
      {
        "type": "paragraph",
        "text": "Removing bottlenecks is, generally speaking, like unkinking a garden hose. You turn on the tap, but nothing comes out. So you walk along the hose, find the kink, straighten it—and suddenly the water flows."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what we&#x27;ve been doing. Finding the kinks. Removing them. Getting the work flowing."
      },
      {
        "type": "paragraph",
        "text": "But the flow doesn&#x27;t stop when the software leaves the team."
      },
      {
        "type": "paragraph",
        "text": "After the developers finish and the testers sign off, the work moves on. To operations. To deployment. To production. And eventually—to the users."
      },
      {
        "type": "paragraph",
        "text": "I&#x27;m not going to talk about operations—the DevOps world has that covered—but there is one link in the chain that doesn&#x27;t get enough attention."
      },
      {
        "type": "paragraph",
        "text": "The users."
      },
      {
        "type": "paragraph",
        "text": "They&#x27;re the ones who have to absorb the change. Learn the new features. Adjust their workflows. Figure out what&#x27;s different."
      },
      {
        "type": "paragraph",
        "text": "And they can only absorb so much."
      },
      {
        "type": "paragraph",
        "text": "Yesterday, I was watering the garden, and my dog came over, excited. She loves drinking from the hose. But she can&#x27;t, not really. The water blasts out, goes everywhere, and she gets a mouthful at best. Most of it just sprays past her."
      },
      {
        "type": "paragraph",
        "text": "Ship too fast, and your users are like my dog. The software&#x27;s fine. There&#x27;s just too much of it, too quickly. They can&#x27;t swallow it."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "I first noticed this years ago while consulting for a government department. They&#x27;d spent two years turning themselves into a good, solid Agile team. They&#x27;d figured out the Timer Team shape before I had a name for it. Work flowed. Releases were frequent. By every internal measure, they were flying."
      },
      {
        "type": "paragraph",
        "text": "But something was going wrong out in the field."
      },
      {
        "type": "paragraph",
        "text": "The department had hundreds of offices spread across the country—places where citizens would come for help with benefits and payments. The staff in those offices used the software that the Agile team was building."
      },
      {
        "type": "paragraph",
        "text": "The staff used to complain about how bad the software was, and how badly it needed fixing, but now that their software teams (off in HQ) had sped up so much, they suddenly had something new to complain about."
      },
      {
        "type": "paragraph",
        "text": "The user interface they’d been using for years kept changing, and it broke their “muscle memory” and slowed them down."
      },
      {
        "type": "paragraph",
        "text": "They couldn’t keep up with the pace of change."
      },
      {
        "type": "paragraph",
        "text": "Worse—almost every release implemented an official policy change."
      },
      {
        "type": "paragraph",
        "text": "The staff started losing track. Which policy was current? What changed last Tuesday? They were giving incorrect advice. Sometimes, citizens received the wrong payments—either too much or too little. Real money. Real consequences. The staff were making mistakes and then spending hours trying to fix them. Doh."
      },
      {
        "type": "paragraph",
        "text": "It was like they were playing Tetris. And some unseen force kept dropping shapes faster and faster."
      },
      {
        "type": "paragraph",
        "text": "The Agile team had no idea this was happening. Their dashboards looked great. They won an award."
      },
      {
        "type": "paragraph",
        "text": "Isn’t it weird how the world works? The Agile team had done everything right—and created a mess."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "<strong>Speed without absorption isn&#x27;t speed.</strong>"
      },
      {
        "type": "paragraph",
        "text": "Remember the bus in <em>Speed</em>, tearing through Los Angeles? It was going fast—but the people in its path were getting hurt. Pedestrians diving out of the way. Cars smashed aside. Damage everywhere."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what was happening to those field staff and the citizens they served. The Agile team was the bus. The users were the bystanders."
      },
      {
        "type": "paragraph",
        "text": "The team looks fast. The pipeline looks healthy. The release notes are impressive."
      },
      {
        "type": "paragraph",
        "text": "But the value isn&#x27;t landing. And people are getting hurt."
      },
      {
        "type": "paragraph",
        "text": "When this happens, the fix isn&#x27;t “ship even more.”"
      },
      {
        "type": "paragraph",
        "text": "The fix is to slow down and think—be thoughtful. Pace the changes. Batch them. Give users time to adapt. It’s an easy problem to solve—once you’re aware of it."
      },
      {
        "type": "paragraph",
        "text": "You&#x27;ve unkinked the hose. Now ease off the tap."
      }
    ]
  },
  {
    "title": "Chapter 8: Protect Your Timer Team",
    "content": [
      {
        "type": "paragraph",
        "text": "Once you&#x27;ve got a Timer Team, your #1 job is to protect it."
      },
      {
        "type": "paragraph",
        "text": "Timer Teams are like a spinning top—fast-moving, beautifully stable, until you stop paying attention."
      },
      {
        "type": "paragraph",
        "text": "Then they wobble and fall."
      },
      {
        "type": "paragraph",
        "text": "Let me tell you about a project I worked on."
      },
      {
        "type": "paragraph",
        "text": "Eighty developers. Chaos. The developers were running so much faster than the testers that the testing team had stopped working with them altogether, packed their bags, and decamped to a separate building, where they kept themselves busy testing code that had been produced several sprints earlier."
      },
      {
        "type": "paragraph",
        "text": "I was called in to rescue the project, and the problem was immediately obvious."
      },
      {
        "type": "paragraph",
        "text": "The team wasn&#x27;t producing potentially shippable software at the end of every sprint—the <em>one thing</em> Agile has to get right for anything else to work."
      },
      {
        "type": "paragraph",
        "text": "So we set about reshaping the team into a U-shape—the only way they could ever actually ship."
      },
      {
        "type": "paragraph",
        "text": "After about six months, they had a Timer Team. A bit ugly looking, with plenty of room to improve. But it worked. They started shipping. They started making money."
      },
      {
        "type": "paragraph",
        "text": "And—this puts a smile on my face as I think about it—they&#x27;d started to like each other again. Many of them had been friends before the chaos—pub on Friday evenings, that sort of thing. But when the test team split off to a separate building, those friendships stopped during work hours. Developers and testers became “them and us.” Now they were “we” again."
      },
      {
        "type": "paragraph",
        "text": "And that&#x27;s when things started to slip."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Another project started. One of the analysts was moved to that project. Everything was still okay."
      },
      {
        "type": "paragraph",
        "text": "A month later, another analyst left to join another company."
      },
      {
        "type": "paragraph",
        "text": "Shortly after that, another analyst went on maternity leave."
      },
      {
        "type": "paragraph",
        "text": "Three analysts. Gone."
      },
      {
        "type": "paragraph",
        "text": "All for good reasons. None of them malicious. But nobody backfilled. After all, things were going so smoothly—surely we can manage with a bit fewer?"
      },
      {
        "type": "paragraph",
        "text": "The hourglass had become a bottle. Neck at the top. Not enough sand getting through."
      },
      {
        "type": "paragraph",
        "text": "There were no longer enough analysts to feed the developers. So they started cutting corners—cherry-picking work that was easy to prepare but took the developers a long time to build. Clever, when you think about it. But commercially, not so smart."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The testers had a different problem."
      },
      {
        "type": "paragraph",
        "text": "For years, they&#x27;d been under enormous pressure—always behind, always scrambling. Now, for the first time, they had breathing room. So they did the sensible thing: they started cross-training, learning how to test different parts of the system."
      },
      {
        "type": "paragraph",
        "text": "A really good idea. Except that it used up all their spare capacity. They couldn&#x27;t give fast feedback anymore. The developers started pulling ahead. They started to drift apart. And no one noticed, for a few weeks."
      },
      {
        "type": "paragraph",
        "text": "<strong>Job number one</strong>: give fast feedback."
      },
      {
        "type": "paragraph",
        "text": "<strong>Job number two</strong>: build system knowledge—but not at the expense of fast feedback and flow."
      },
      {
        "type": "paragraph",
        "text": "Spare capacity isn&#x27;t wasted capacity. It&#x27;s what makes the shape work. It&#x27;s what lets the testers give fast feedback."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The Timer Team shape isn&#x27;t natural. It takes effort to maintain—constant, uncomfortable effort."
      },
      {
        "type": "paragraph",
        "text": "The two situations were slightly different. The analysts—we lost people. Nobody backfilled. The testers—we kept the people, but they used up their slack. Same result: the shape broke."
      },
      {
        "type": "paragraph",
        "text": "Protect your headcount. Protect your slack."
      },
      {
        "type": "paragraph",
        "text": "When things are going well, it&#x27;s tempting to relax. The team is humming. Delivery is flowing. Everyone is happy. Surely we can move an analyst here. Skip a backfill there. Use up that spare capacity on something useful."
      },
      {
        "type": "paragraph",
        "text": "All for good reasons."
      },
      {
        "type": "paragraph",
        "text": "The natural state—the comfortable state—is for everyone to be equally busy. Fully utilized. No slack anywhere."
      },
      {
        "type": "paragraph",
        "text": "But that&#x27;s exactly when the problems start."
      },
      {
        "type": "paragraph",
        "text": "A Timer Team doesn&#x27;t protect itself. You have to protect it."
      },
      {
        "type": "paragraph",
        "text": "And once you&#x27;ve protected it—then you can grow it."
      }
    ]
  },
  {
    "title": "Chapter 9: Growing the Bottleneck",
    "content": [
      {
        "type": "paragraph",
        "text": "Several years after those conversations in Edinburgh, Rosie&#x27;s company hired me as a consultant. I hadn&#x27;t seen her since the good old days."
      },
      {
        "type": "paragraph",
        "text": "“Remember when you helped me set up my team?” she said. “Testers, analysts, and all that?”"
      },
      {
        "type": "paragraph",
        "text": "“Of course.”"
      },
      {
        "type": "paragraph",
        "text": "“It worked. The team is still running well. But now I’ve got a new challenge.”"
      },
      {
        "type": "paragraph",
        "text": "“Oh?”"
      },
      {
        "type": "paragraph",
        "text": "“The business is growing. We need to go faster, and I need to grow the team.”"
      },
      {
        "type": "paragraph",
        "text": "I nodded."
      },
      {
        "type": "paragraph",
        "text": "“Obviously, my first thought is that I should hire more developers. But I know that I can&#x27;t just add developers without adding capacity in the other roles too. So I&#x27;ve got a plan—hire people who can flex. An analyst-programmer. A developer who&#x27;s good at helping testers with automation. That way, I&#x27;m growing capacity in multiple places at once.”"
      },
      {
        "type": "paragraph",
        "text": "“Smart.”"
      },
      {
        "type": "paragraph",
        "text": "“And actually,” she said, “because we&#x27;re working well with one analyst for every three developers, I don&#x27;t need to hire many new analysts. Three more developers, one more analyst. The ratio works in my favor. Same idea with testers.”"
      },
      {
        "type": "paragraph",
        "text": "“What else have you thought about?”"
      },
      {
        "type": "paragraph",
        "text": "She paused. “Dunno. That&#x27;s why we&#x27;re talking.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "“Have you ever been to a museum?” I asked."
      },
      {
        "type": "paragraph",
        "text": "She looked at me sideways. “What&#x27;s that got to do with anything?”"
      },
      {
        "type": "paragraph",
        "text": "“Bear with me. A museum has limited display space. Precious space. They can&#x27;t show everything. So the curator chooses very carefully what goes on display.”"
      },
      {
        "type": "paragraph",
        "text": "“Okay …”"
      },
      {
        "type": "paragraph",
        "text": "“If they choose big pieces, they can only display a few. If they choose smaller pieces, they can display many. Same size room. Very different results.”"
      },
      {
        "type": "paragraph",
        "text": "She raised an eyebrow. “And you&#x27;re saying my developers are somehow like the display space?”"
      },
      {
        "type": "paragraph",
        "text": "“Kinda. Your developers are the precious resource. The bottleneck. And the work you feed them is like the art you choose to display.”"
      },
      {
        "type": "paragraph",
        "text": "“Give me an example.”"
      },
      {
        "type": "paragraph",
        "text": "“Imagine you&#x27;ve got two feature requests coming in from marketing. As far as you can tell, they&#x27;re equal in value to the customer. Both need the same amount of analyst time. Both need the same amount of testing. But one requires three weeks of developer time, and the other requires one week. Which one should you choose?”"
      },
      {
        "type": "paragraph",
        "text": "“Then all things being equal, we&#x27;d do the one-week one first,” she said. “We&#x27;d get more value through the bottleneck.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly. That&#x27;s curation. Prioritizing work that uses less precious developer time—for the same customer value.”"
      },
      {
        "type": "paragraph",
        "text": "“That&#x27;s clever and obvious at the same time,” Rosie said. “We’d use the same principle if we had one feature that had two possible solutions, and they required different analysis, developer, and testing time, right?”"
      },
      {
        "type": "paragraph",
        "text": "“Yes. You’ve got it,” I said, then added an important warning. “But, look, you&#x27;ve got to be careful—if you keep picking work that&#x27;s light on developers but heavy on the other roles, you risk turning those other roles into bottlenecks.”"
      },
      {
        "type": "paragraph",
        "text": "She considered this for a moment. “So, we curate the work, but protect the shape.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly.”"
      }
    ]
  },
  {
    "title": "Part 3: The People Who Make Teams Work",
    "content": []
  },
  {
    "title": "Chapter 10: Scrum Masters and Delivery Managers",
    "content": [
      {
        "type": "paragraph",
        "text": "When Scrum Masters (and similar roles) have enough capacity, everything runs smoothly. Like a well-oiled machine. Why? Because they have time to add the oil."
      },
      {
        "type": "paragraph",
        "text": "A big part of their job is creating Timer Teams, protecting them, and helping them grow. But day-to-day, well-shaped Timer Teams will underperform if their Scrum Master is overloaded and has become a bottleneck."
      },
      {
        "type": "paragraph",
        "text": "When they&#x27;re spread too thin, the gears get stuck. The makers blame them. Think they&#x27;re incompetent. But it&#x27;s usually not competence. It&#x27;s capacity."
      },
      {
        "type": "paragraph",
        "text": "Back in 2004, I was working as a Scrum Master on a nonsoftware project. The details don&#x27;t matter."
      },
      {
        "type": "paragraph",
        "text": "I took on one team. It went well. Great feedback. I was loving it."
      },
      {
        "type": "paragraph",
        "text": "Then I took on a second team. Still fine. More compliments. Feeling rather heroic."
      },
      {
        "type": "paragraph",
        "text": "Then a third."
      },
      {
        "type": "paragraph",
        "text": "That third team was like the straw that broke the camel&#x27;s back—except it wasn&#x27;t gradual. One week, everything was fine. The next week, it wasn&#x27;t. My teams started drifting. Small problems I would have caught early turned into big problems. I was firefighting constantly, spinning too many plates."
      },
      {
        "type": "paragraph",
        "text": "I still felt heroic, but truthfully, I wasn&#x27;t doing a good job. It’s important to point that out because a lot of us “helpers” are wired that way."
      },
      {
        "type": "paragraph",
        "text": "Then a colleague said something that stuck with me: “You&#x27;re like a coxswain in a rowing boat. Yes, you add weight, but you keep everyone rowing in sync, and the boat goes faster because of you. But you can&#x27;t cox three boats at once.”"
      },
      {
        "type": "paragraph",
        "text": "She was right. Stand-ups still happened. Some impediments got removed. But the watching, the noticing, the improving—all that quiet Scrum Master stuff that no one else notices had disappeared."
      },
      {
        "type": "paragraph",
        "text": "To be clear: spreading one Scrum Master across three or four teams can work—when the teams are stable, the system is healthy, and the job is mostly light steering."
      },
      {
        "type": "paragraph",
        "text": "But there&#x27;s a tipping point. And you often don&#x27;t see it coming until you&#x27;ve passed it."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what makes this so insidious. When a Scrum Master is doing their job well, it looks like they have spare time. So someone gives them another team."
      },
      {
        "type": "paragraph",
        "text": "And just like that, you&#x27;ve turned a good Scrum Master into a mediocre one—and good teams into mediocre teams."
      }
    ]
  },
  {
    "title": "Chapter 11: The Tech Lead Problem",
    "content": [
      {
        "type": "paragraph",
        "text": "I was hired to help out two midlevel leaders at a media company—a lead analyst and a tech lead called Nigel. Their team had grown since business was good, and they’d split one larger team into several smaller teams. Logical and sensible."
      },
      {
        "type": "paragraph",
        "text": "But one team in particular wasn’t performing well."
      },
      {
        "type": "paragraph",
        "text": "“It’s this team of three,” Nigel said. “They’ve got a backlog of bugs that keeps growing. The more work they do, the more bugs they produce.”"
      },
      {
        "type": "paragraph",
        "text": "“What do you think is going on?”"
      },
      {
        "type": "paragraph",
        "text": "He shrugged. “I sometimes wonder if all they’re doing is writing bugs. But honestly, I don’t know. I haven’t had time to dig in.”"
      },
      {
        "type": "paragraph",
        "text": "There it was."
      },
      {
        "type": "paragraph",
        "text": "Whenever you hear someone say that they haven’t had time to do part of their job—that’s a warning sign. It means they can’t keep up with their workload. It means they are a bottleneck."
      },
      {
        "type": "paragraph",
        "text": "And bottlenecks slow everyone down."
      },
      {
        "type": "paragraph",
        "text": "Unfortunately, I didn’t pick up on it immediately. It took another couple of conversations before we all realized what was happening."
      },
      {
        "type": "paragraph",
        "text": "“Nigel, those three developers—how experienced are they?”"
      },
      {
        "type": "paragraph",
        "text": "“Fairly junior. They’re good, but they need guidance.”"
      },
      {
        "type": "paragraph",
        "text": "“And who’s giving them that guidance?”"
      },
      {
        "type": "paragraph",
        "text": "He paused. “Me. I mean, I’m supposed to be.”"
      },
      {
        "type": "paragraph",
        "text": "I frowned. “How often do you actually work with them?”"
      },
      {
        "type": "paragraph",
        "text": "A long silence. “Not enough. I’ve got four teams now. I check in when I can, but …”"
      },
      {
        "type": "paragraph",
        "text": "“But they’re not getting the coaching they need.”"
      },
      {
        "type": "paragraph",
        "text": "He stared at the table. “No. They’re not.”"
      },
      {
        "type": "paragraph",
        "text": "It was like a little bus with three people on it, driving around, crashing into things—because they hadn’t been taught how to drive properly yet."
      },
      {
        "type": "paragraph",
        "text": "Nigel looked up. “So all those bugs. All that rework. That’s because of me?”"
      },
      {
        "type": "paragraph",
        "text": "“It’s because you’re spread too thin.”"
      },
      {
        "type": "paragraph",
        "text": "He wasn’t happy about that. But he couldn’t argue with it either."
      },
      {
        "type": "paragraph",
        "text": "We talked for a few more minutes and came up with a handful of possible solutions:"
      },
      {
        "type": "paragraph",
        "text": "•\tShut down the team and move the junior devs onto other teams where they can be properly mentored."
      },
      {
        "type": "paragraph",
        "text": "•\tPromote a senior developer to become a second tech lead."
      },
      {
        "type": "paragraph",
        "text": "•\tMove an experienced developer onto the struggling team as a day-to-day mentor."
      },
      {
        "type": "paragraph",
        "text": "•\tHave Nigel focus most of his attention on the weakest team until they&#x27;re self-sufficient."
      },
      {
        "type": "paragraph",
        "text": "Nigel decided to shut down the team and promote a senior developer to become a second tech lead."
      },
      {
        "type": "paragraph",
        "text": "“Those junior developers deserved better than that. And their project wasn&#x27;t all that important anyway—which is why I gave them less attention, I suppose.”"
      },
      {
        "type": "paragraph",
        "text": "Nigel&#x27;s problem is common. Leaders at every level get spread too thin—tech leads, delivery managers, directors, and executives. It&#x27;s not just the norm—it&#x27;s often the expectation. Being overwhelmed is worn like a badge of honor."
      },
      {
        "type": "paragraph",
        "text": "But the best leaders I&#x27;ve worked with aren&#x27;t overwhelmed. They&#x27;re not spreading themselves too thin. And that&#x27;s not by accident—they&#x27;ve learned to protect their capacity the same way a Timer Team protects its shape."
      }
    ]
  },
  {
    "title": "Chapter 12: The Hardest Lesson",
    "content": [
      {
        "type": "paragraph",
        "text": "For twenty years, I felt guilty."
      },
      {
        "type": "paragraph",
        "text": "I&#x27;d set up my work life so that I wasn&#x27;t busy all the time. Deliberately. And it felt like cheating."
      },
      {
        "type": "paragraph",
        "text": "I tried to hide it because it looked bad."
      },
      {
        "type": "paragraph",
        "text": "But I got results. And I got paid a big salary and big bonuses because of those results."
      },
      {
        "type": "paragraph",
        "text": "But it felt wrong."
      },
      {
        "type": "paragraph",
        "text": "Everyone around me wore exhaustion like a badge of honor. Back-to-back meetings. Overflowing inboxes. “Sorry, I&#x27;m slammed” as a greeting. They were busy being busy. And there I was—with gaps in my calendar. On purpose."
      },
      {
        "type": "paragraph",
        "text": "For most of my thirties and forties, I couldn&#x27;t shake the guilt."
      },
      {
        "type": "paragraph",
        "text": "Then, in my early fifties, I got a personal trainer. I learned two lessons from her. And the guilt finally made sense (and then it disappeared)."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Let&#x27;s start with the second lesson."
      },
      {
        "type": "paragraph",
        "text": "My personal trainer—I&#x27;ll call her B—only schedules twenty hours a week with clients."
      },
      {
        "type": "paragraph",
        "text": "I asked her about it one day, after a session."
      },
      {
        "type": "paragraph",
        "text": "“Twenty hours seems low,” I said. “You could fit in more, couldn&#x27;t you? Double your income.”"
      },
      {
        "type": "paragraph",
        "text": "She shook her head. “I could. But I&#x27;d be worse at my job.”"
      },
      {
        "type": "paragraph",
        "text": "“How come?”"
      },
      {
        "type": "paragraph",
        "text": "“Two reasons,” she said. “First—this work is hard. Physically, mentally, and emotionally. If I do more than twenty hours of sessions, I wear myself out. I get tired. I get sloppy. My clients get a worse version of me.”"
      },
      {
        "type": "paragraph",
        "text": "That sounded familiar. My work was the same."
      },
      {
        "type": "paragraph",
        "text": "“And the second reason?”"
      },
      {
        "type": "paragraph",
        "text": "“My clients pay good money. They expect me to be flexible when life gets in the way. Their meeting runs late. Their kid gets sick. Something comes up. If I&#x27;m booked back-to-back with no gaps, I can&#x27;t flex. I have to say no. And they feel like they&#x27;re not getting what they paid for.”"
      },
      {
        "type": "paragraph",
        "text": "“So you leave gaps on purpose.”"
      },
      {
        "type": "paragraph",
        "text": "“I only book in twenty hours,” she said. “But it&#x27;s not like I work only twenty hours. I have plenty of other stuff to do during that time. Admin, planning, and my own training. I just don&#x27;t commit it to clients.”"
      },
      {
        "type": "paragraph",
        "text": "“So you&#x27;ve got flexibility.”"
      },
      {
        "type": "paragraph",
        "text": "“Exactly. If someone needs to reschedule, I can. If I&#x27;m tired, I&#x27;ve got breathing room. If something comes up, I&#x27;m not scrambling.”"
      },
      {
        "type": "paragraph",
        "text": "I sat with that for a moment. I&#x27;d known this for years. But I&#x27;d never heard anyone else describe it so simply."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Now here&#x27;s the first lesson."
      },
      {
        "type": "paragraph",
        "text": "After my very first session with her, I was buzzing. Energized. Enthusiastic. I wanted more."
      },
      {
        "type": "paragraph",
        "text": "“This was great,” I said. “Can we do four sessions a week instead of two?”"
      },
      {
        "type": "paragraph",
        "text": "She looked at me. “No.”"
      },
      {
        "type": "paragraph",
        "text": "I looked at her with a ‘huh?’ face."
      },
      {
        "type": "paragraph",
        "text": "“If I let you do four sessions a week, you&#x27;ll be sore all the time. You&#x27;ll dread coming in. You&#x27;ll start canceling. Within a month, you&#x27;ll quit. You need time to recover.”"
      },
      {
        "type": "paragraph",
        "text": "She paused."
      },
      {
        "type": "paragraph",
        "text": "“Burnt-out clients don&#x27;t come back. They don&#x27;t get the results they wanted. And I lose them. That’s bad for them, and bad for my business.”"
      },
      {
        "type": "paragraph",
        "text": "I frowned, disappointed. I&#x27;d never wanted to go to the gym before. “So two sessions are better for me?”"
      },
      {
        "type": "paragraph",
        "text": "“Two sessions are better for both of us. You make progress. You don&#x27;t hate it. You keep coming back. And I keep a client.”"
      },
      {
        "type": "paragraph",
        "text": "She was right. I&#x27;ve been going back for years now, and that’s only because she didn&#x27;t let me scare myself away."
      },
      {
        "type": "paragraph",
        "text": "B didn’t overbook herself, and she didn’t let me overbook myself."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "When I saw how she worked, something clicked."
      },
      {
        "type": "paragraph",
        "text": "For twenty years, I&#x27;d been doing the same thing—pacing my clients, keeping slack in my calendar—but feeling guilty about it. I&#x27;d never had a role model. Everyone around me was busy being busy. I was the odd one out, and I knew that some people thought I was lazy (despite the results I was getting)."
      },
      {
        "type": "paragraph",
        "text": "Turns out, personal trainers figured this out long ago. They just don&#x27;t write business books about it."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Let’s step back and take a breath."
      },
      {
        "type": "paragraph",
        "text": "Sometimes the bottleneck is you—you’re too busy to be any good."
      },
      {
        "type": "paragraph",
        "text": "But here&#x27;s the thing: the higher you climb, the harder this gets. And the more it matters."
      },
      {
        "type": "paragraph",
        "text": "When a Scrum Master is stretched too thin, a few teams suffer. When a Tech Lead can&#x27;t coach their juniors, bugs pile up."
      },
      {
        "type": "paragraph",
        "text": "But when a senior leader becomes the bottleneck—when the person setting direction for dozens or hundreds of people is too overwhelmed to think—the whole organization runs in the wrong direction."
      },
      {
        "type": "paragraph",
        "text": "In a Timer Team, everyone else exists to protect the bottleneck&#x27;s capacity for the work that matters most. The same principle applies to leaders."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s a different scale of problem."
      },
      {
        "type": "paragraph",
        "text": "And it needs a different chapter (or three, actually)."
      }
    ]
  },
  {
    "title": "Part 4: When the Bottleneck Is at the Top",
    "content": [
      {
        "type": "paragraph",
        "text": "We&#x27;ve shaped the teams. Now we shape the leadership."
      },
      {
        "type": "paragraph",
        "text": "Everything in Parts 1-3 assumes the leaders have time to do this work. But what happens when they don&#x27;t? What happens when they&#x27;re the bottleneck?"
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s often where we have to start."
      }
    ]
  },
  {
    "title": "Chapter 13: The Big Cheese Bottleneck",
    "content": [
      {
        "type": "paragraph",
        "text": "I&#x27;d been brought in to help a company&#x27;s senior leaders use the <em>Theory of Constraints</em> (what I call <em>Bottleneck Thinking</em>) better in practice. They already knew about bottlenecks—the founder was a genius who&#x27;d built the business on ToC, and many of the staff had extensive training in it. But knowing the theory and putting it into practice are two different things. Especially when the bottleneck is a person."
      },
      {
        "type": "paragraph",
        "text": "Brie was one of the product leaders. She had a staff of twenty-five and a huge demand for more software. I first met with her entire team. I had my bottleneck detective hat on, watching, listening, and trying to figure out where the bottleneck was."
      },
      {
        "type": "paragraph",
        "text": "It didn&#x27;t take long."
      },
      {
        "type": "paragraph",
        "text": "Every question came back to Brie. Every decision waited for Brie. Every escalation landed on Brie&#x27;s desk. She was running the meeting, answering the questions, solving the problems, and reassuring the team. Heroic. Impressive. And completely unsustainable."
      },
      {
        "type": "paragraph",
        "text": "After the meeting, I pulled aside one of her peers."
      },
      {
        "type": "paragraph",
        "text": "“Is Brie always this stretched?”"
      },
      {
        "type": "paragraph",
        "text": "He laughed. “Always. For years. That&#x27;s just Brie.”"
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s how you know it&#x27;s a bottleneck. When everyone&#x27;s so used to it, they&#x27;ve stopped seeing it."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The thing is, everyone could kind of see it. And everyone was blind to it. Both at the same time."
      },
      {
        "type": "paragraph",
        "text": "This hadn&#x27;t just suddenly happened. It had crept up slowly—Brie taking on more, coping, succeeding, and drowning. So gradually that it became normal. The company had grown around her bottleneck. They&#x27;d adapted to her speed without realizing it. She never complained. She always delivered. So they didn&#x27;t see a bottleneck. They just saw Brie."
      },
      {
        "type": "paragraph",
        "text": "(Brie isn&#x27;t her real name—but her story is.)"
      },
      {
        "type": "paragraph",
        "text": "Without saying anything in front of the team, I suggested we set up a 1:1."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "“I&#x27;m not really the bottleneck,” she said when we met. “I still cope.”"
      },
      {
        "type": "paragraph",
        "text": "She wasn&#x27;t defensive. She was curious, thoughtful, and genuine. The kind of leader people respect because she respects them. But she couldn&#x27;t see what everyone else could see—because she was too busy coping to notice."
      },
      {
        "type": "paragraph",
        "text": "I drew three circles on a whiteboard. A Venn diagram."
      },
      {
        "type": "paragraph",
        "text": "“Leaders usually have three jobs,” I said. “Leading. Managing. Being an expert. Which of these are you doing?”"
      },
      {
        "type": "paragraph",
        "text": "She looked at the diagram. “All three.”"
      },
      {
        "type": "paragraph",
        "text": "“In my experience,” I said, “a lot of very good leaders get so overwhelmed with all the managing and expertise stuff that they inadvertently sacrifice their leadership work.”"
      },
      {
        "type": "paragraph",
        "text": "She looked at the diagram again. “The thinking-ahead stuff. Setting direction.” She nodded slowly. “There&#x27;s never time for that. The other two are too urgent.”"
      },
      {
        "type": "paragraph",
        "text": "“There&#x27;s a fourth thing that&#x27;s not on the diagram,” I said. “Your life outside of work.”"
      },
      {
        "type": "paragraph",
        "text": "She paused. Snorted."
      },
      {
        "type": "paragraph",
        "text": "She answered indirectly. “I used to do Pilates,” she said. “Fifteen years ago. I keep telling myself I&#x27;ll go back when things calm down.”"
      },
      {
        "type": "paragraph",
        "text": "“Have they?”"
      },
      {
        "type": "paragraph",
        "text": "She smiled, but it wasn&#x27;t a happy smile. “No. Not yet. I remain hopeful.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "There&#x27;s a pattern here, and it&#x27;s worth understanding."
      },
      {
        "type": "paragraph",
        "text": "Leaders often have three jobs: leading, managing, and being an expert. When they get stretched too thin, one has to give—and it&#x27;s almost always leadership first."
      },
      {
        "type": "paragraph",
        "text": "Why? Because the other two are urgent. Stop sharing your expertise, and people get stuck. They come knocking. Stop managing—vacation requests pile up, timesheets go unsigned—and people complain. Loudly."
      },
      {
        "type": "paragraph",
        "text": "But leadership? Setting direction, coaching, and thinking ahead? That&#x27;s important, but it&#x27;s not urgent. No one knocks on your door because you haven&#x27;t thought about next quarter. No one sends a chasing email because you skipped a coaching conversation. The pain comes later—in bugs, in rework, and in teams that drift off course."
      },
      {
        "type": "paragraph",
        "text": "Brie was doing all three jobs, and day to day, the team was zooming, hyperproductive. But leadership was suffering. Brie still needed to sleep."
      },
      {
        "type": "paragraph",
        "text": "And there&#x27;s a fourth thing that drops too—often before leadership does. Their personal life. Their family. Their health. Their hobbies. Their time to just be a person. That&#x27;s what gets sacrificed first, and it&#x27;s often what gets recovered last."
      },
      {
        "type": "paragraph",
        "text": "Fifteen years without Pilates. That&#x27;s not a scheduling problem. That&#x27;s a life."
      },
      {
        "type": "paragraph",
        "text": "<em>So how does a good leader end up here?</em>"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Brie&#x27;s story, like so many others, started with success."
      },
      {
        "type": "paragraph",
        "text": "Sometimes it&#x27;s a new project that gets greenlit. Sometimes it&#x27;s a market shift that sends demand through the roof. For Brie, the world changed one day, causing a wave of demand no one could have ever predicted. Her company was successful—and then it suddenly exploded (in a good way, not like the bus). Sales soared, and the operational side of the business couldn&#x27;t keep up manually. They needed to automate, fast. Which meant they needed more software, fast. Which meant they needed Brie&#x27;s teams to grow, fast."
      },
      {
        "type": "paragraph",
        "text": "At first, she was happy. Then reality set in."
      },
      {
        "type": "paragraph",
        "text": "Growth needs people. The company hires. And who&#x27;s responsible for all these new people? The senior leader. Suddenly, they&#x27;re doing the job of two or three people. They struggle to keep up. They&#x27;re so busy managing, they don&#x27;t have time to lead."
      },
      {
        "type": "paragraph",
        "text": "They&#x27;ve become the bottleneck—the neck at the very top of the hourglass, with not enough sand getting through. The problem is, they don&#x27;t realize it. Or they don&#x27;t want to admit it. And they&#x27;re often very good at hiding it from everyone else."
      },
      {
        "type": "paragraph",
        "text": "Brie had a staff of twenty-five when I met her. She was already maxed out. And now the company needed her to grow."
      },
      {
        "type": "paragraph",
        "text": "“I thought I&#x27;d be excited,” she told me. “We were growing. We were winning. But I just felt … underwater.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "I&#x27;ve watched leaders do this, and it&#x27;s painful to see. They buy a time management book, but don&#x27;t have time to read it. They take a productivity course, but don&#x27;t have time to watch it. They start working later and later, telling themselves they&#x27;re being heroic. They start micromanaging because it&#x27;s easier to do it themselves than to explain it."
      },
      {
        "type": "paragraph",
        "text": "And they feel guilty for sacrificing their family time. They feel incompetent sometimes—but really they&#x27;re just overwhelmed. Deep inside, they start to begrudge the staff who protect their personal time, though they never say it. They reward the others who sacrifice their own lives. They start to think that being thick-skinned is a virtue."
      },
      {
        "type": "paragraph",
        "text": "Underneath it all, they believe the problem is their time management. They believe they&#x27;re not the bottleneck—they&#x27;re just very busy. They believe that if they take a break, everything will break."
      },
      {
        "type": "paragraph",
        "text": "None of that is true."
      },
      {
        "type": "paragraph",
        "text": "What worked in quieter times no longer works."
      },
      {
        "type": "paragraph",
        "text": "<em>So how do you know if you&#x27;ve become the bottleneck?</em>"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "“How do I know if I&#x27;m really the bottleneck?” Brie asked."
      },
      {
        "type": "paragraph",
        "text": "“Two tells,” I said. “First: you&#x27;re working all the hours you can possibly find, and there&#x27;s still not enough.”"
      },
      {
        "type": "paragraph",
        "text": "She nodded slowly."
      },
      {
        "type": "paragraph",
        "text": "“Second: your inbox is a queue of waiting decisions. People are waiting for you. If people are always waiting for you, you&#x27;re the bottleneck. Your entire team runs at the speed of you.”"
      },
      {
        "type": "paragraph",
        "text": "She was quiet for a moment."
      },
      {
        "type": "paragraph",
        "text": "“I have both of those,” she said. “I just didn&#x27;t know what to do about them.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Debottlenecking a leader is much more than time management. It&#x27;s learning to delegate. Learning to build teams. Learning how to make change without upsetting people. Learning how to grow the people who work with you—in the same way you&#x27;re growing yourself, except that you&#x27;re just a few chapters ahead in the book."
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s getting assistance. It&#x27;s making time to lead."
      },
      {
        "type": "paragraph",
        "text": "If you don&#x27;t, your business can only grow as fast as you can. And you&#x27;re already maxed out."
      },
      {
        "type": "paragraph",
        "text": "<em>So where do you start?</em>"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "“Here&#x27;s where we start,” I said. “You need time to lead. Just a little time. An hour a week.”"
      },
      {
        "type": "paragraph",
        "text": "“I don&#x27;t have an hour.”"
      },
      {
        "type": "paragraph",
        "text": "“Let&#x27;s find out. Show me your calendar.”"
      },
      {
        "type": "paragraph",
        "text": "She turned her laptop toward me. Wall-to-wall meetings. Every day. For weeks."
      },
      {
        "type": "paragraph",
        "text": "“This one,” I said, pointing. “What&#x27;s this?”"
      },
      {
        "type": "paragraph",
        "text": "“Status update. It&#x27;s been running for two years.”"
      },
      {
        "type": "paragraph",
        "text": "“Do you need to be there?”"
      },
      {
        "type": "paragraph",
        "text": "She hesitated. “Probably not. Not anymore.”"
      },
      {
        "type": "paragraph",
        "text": "“And this one?”"
      },
      {
        "type": "paragraph",
        "text": "“That&#x27;s … actually, I don&#x27;t know why I&#x27;m still in that one.”"
      },
      {
        "type": "paragraph",
        "text": "We canceled two meetings in the first ten minutes."
      },
      {
        "type": "paragraph",
        "text": "And booked our next session."
      },
      {
        "type": "paragraph",
        "text": "We called the meeting “Time to Think; Time to Lead.”"
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s how it began."
      },
      {
        "type": "paragraph",
        "text": "Despite being the hardest worker in the company, Brie was standing between her company and its future. She was also the key to unlocking it."
      }
    ]
  },
  {
    "title": "Chapter 14: The Hermit Crab",
    "content": [
      {
        "type": "paragraph",
        "text": "At first, I thought of snakes—they shed their skin as they grow, then grow some more, then shed again. But no one wants to be compared to a snake. And it felt too smooth, too linear. That wasn&#x27;t what Brie was experiencing."
      },
      {
        "type": "paragraph",
        "text": "Then I thought of hermit crabs."
      },
      {
        "type": "paragraph",
        "text": "Hermit crabs don&#x27;t have their own shell. They find one, climb in, and make it home. But as they grow, the shell gets tight. Eventually, it no longer fits. They have to leave."
      },
      {
        "type": "paragraph",
        "text": "And here&#x27;s the vulnerable part: they have to go naked. Just for a moment. Exposed. Soft. Unprotected. They dash across the sand and climb into a bigger shell."
      },
      {
        "type": "paragraph",
        "text": "Then they do it all over again."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "You&#x27;re in a shell that fits. You know how to do this job. You&#x27;ve figured out the systems, the relationships, and the rhythms. It works."
      },
      {
        "type": "paragraph",
        "text": "Then the company grows. Or your responsibilities expand. Or—like Brie—the world changes, and suddenly everything accelerates."
      },
      {
        "type": "paragraph",
        "text": "The shell doesn&#x27;t fit anymore. But you&#x27;re still in it, cramped, squeezed, and trying to do what you&#x27;ve always done. That&#x27;s when you become a bottleneck."
      },
      {
        "type": "paragraph",
        "text": "Growing to a bigger shell <em>is</em> debottlenecking. But it means leaving the old shell behind."
      },
      {
        "type": "paragraph",
        "text": "<em>So what does that actually mean?</em>"
      },
      {
        "type": "paragraph",
        "text": "“What do I have to let go of?” Brie asked me once."
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s a hard question. The things that got you here won&#x27;t get you there—but they feel like <em>you</em>. Your expertise. Your hands-on involvement. Your ability to answer every question. That&#x27;s who you&#x27;ve been."
      },
      {
        "type": "paragraph",
        "text": "In the old shell, Brie knew everything. She was on top of every project, every decision, and every detail. That&#x27;s what made her great."
      },
      {
        "type": "paragraph",
        "text": "In the new shell, she couldn&#x27;t be on top of everything. There was too much. She had to let other people know things. She had to trust them. She had to step back."
      },
      {
        "type": "paragraph",
        "text": "“It feels like I&#x27;m becoming less useful,” she said."
      },
      {
        "type": "paragraph",
        "text": "“You&#x27;re becoming useful in a different way,” I said. “The old way doesn&#x27;t scale. The new way does.”"
      },
      {
        "type": "paragraph",
        "text": "<em>So what does growing through shells actually look like?</em>"
      },
      {
        "type": "paragraph",
        "text": "We worked together for four years. And in that time, Brie moved through several shells."
      },
      {
        "type": "paragraph",
        "text": "At twenty-five people, she could know everyone. She could be in every meeting. She could make every decision."
      },
      {
        "type": "paragraph",
        "text": "At fifty people, she couldn&#x27;t. She had to build a leadership team. She had to delegate whole areas, not just tasks."
      },
      {
        "type": "paragraph",
        "text": "At one hundred people, she had to delegate to people who delegated to others. She was two steps removed from the work. That felt strange."
      },
      {
        "type": "paragraph",
        "text": "At 200, 300, 400—each time, another shell. Another moment of being naked and vulnerable. Another set of things to leave behind, another set of things to learn."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Here&#x27;s the beautiful thing about hermit crabs."
      },
      {
        "type": "paragraph",
        "text": "When a bigger shell becomes available, they don&#x27;t just swap one at a time. They line up—biggest to smallest—and they all move up together. The big one takes the new shell. The next one takes the shell that the big one left behind. And so on, all the way down the line."
      },
      {
        "type": "paragraph",
        "text": "There are videos of this. David Attenborough narrated one. It&#x27;s awe-inspiring to watch."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what happened with Brie&#x27;s team."
      },
      {
        "type": "paragraph",
        "text": "When she moved to a bigger shell, the people below her had to grow too. Her senior leaders had to step up into the space she&#x27;d left. And <em>their</em> people had to step up into the space <em>they&#x27;d</em> left. The whole organization cascaded upward."
      },
      {
        "type": "paragraph",
        "text": "Every time we debottlenecked Brie, we had to debottleneck the next layer too. And the next. It was slow, careful work."
      },
      {
        "type": "paragraph",
        "text": "Hiring developers was easy—they came with technical skills and could learn the codebase. But growing product people was slow. It required deep local knowledge. You couldn&#x27;t just hire it in. We had to grow it internally."
      },
      {
        "type": "paragraph",
        "text": "The team structure kept evolving over those four years. We worked hard to make sure we made those changes in ways that people liked. Brie told me later that people didn&#x27;t resist it. They welcomed it. Change didn&#x27;t have to mean upheaval. It could mean growth."
      },
      {
        "type": "paragraph",
        "text": "<em>So what was the biggest shift?</em>"
      },
      {
        "type": "paragraph",
        "text": "One of the biggest shifts was hiring a chief of staff."
      },
      {
        "type": "paragraph",
        "text": "Not an administrative assistant—a chief of staff. Someone who could take the management load off Brie&#x27;s shoulders so she could focus on leading."
      },
      {
        "type": "paragraph",
        "text": "Leaders usually try to delegate their expertise first. It makes sense—that&#x27;s the valuable stuff, the hard stuff. But expertise is hard to hand over. It takes years to build. You can&#x27;t just give it to someone."
      },
      {
        "type": "paragraph",
        "text": "Management is different. Management can be delegated—if you find someone you trust, someone who knows how to get things done, and someone who can manage up when needed."
      },
      {
        "type": "paragraph",
        "text": "“What&#x27;s the job description?” Brie asked."
      },
      {
        "type": "paragraph",
        "text": "“Don&#x27;t write one,” I said. “Find someone you trust. Then tell them: figure out how to do your job.”"
      },
      {
        "type": "paragraph",
        "text": "She looked skeptical. But she tried it."
      },
      {
        "type": "paragraph",
        "text": "It was huge."
      },
      {
        "type": "paragraph",
        "text": "Her chief of staff took on the coordination, the scheduling, the follow-ups, and the operational rhythm. Brie got time back. Not just an hour a week anymore—real time. Time to think. Time to lead."
      },
      {
        "type": "paragraph",
        "text": "As the organization grew, more of Brie&#x27;s executive-level leaders started bringing on their own chiefs of staff. At first, it was tricky—they didn&#x27;t know how to delegate to them. They thought they needed to define every task, every responsibility."
      },
      {
        "type": "paragraph",
        "text": "The trick was simpler: find someone you trust who knows how to manage. Then let them figure out how to help you."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Each new shell required new skills."
      },
      {
        "type": "paragraph",
        "text": "Brie had to learn to let go of details. She had to learn to trust people who weren&#x27;t as good as her—yet. She had to learn to set direction without controlling execution. She had to learn to coach instead of fix."
      },
      {
        "type": "paragraph",
        "text": "“I feel like I don&#x27;t know what I&#x27;m doing,” she told me once, twice, a dozen times."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s the thing about really clever hermit crabs. They&#x27;re always moving to a bigger shell. Always moving out of their comfort zone. Always stretching. They make stuff up as they go along—that&#x27;s almost their job description, just like Brie&#x27;s new chief of staff."
      },
      {
        "type": "paragraph",
        "text": "And they thrive."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The hermit crab journey isn&#x27;t comfortable. You don&#x27;t get to stay in one shell forever. If your company is growing, if your responsibilities are expanding, and if the world is changing—you have to keep moving."
      },
      {
        "type": "paragraph",
        "text": "Leave things behind. Learn new things. Go naked for a moment. Find the bigger shell."
      },
      {
        "type": "paragraph",
        "text": "Brie did it over and over. And so did her team, cascading up behind her."
      },
      {
        "type": "paragraph",
        "text": "But there was still a problem. Even with all this growth, even with the chief of staff, the evolving structure, and the new skills—Brie was still drowning."
      },
      {
        "type": "paragraph",
        "text": "She was in a bigger shell. But she was still maxed out."
      },
      {
        "type": "paragraph",
        "text": "Something else had to change."
      }
    ]
  },
  {
    "title": "Chapter 15: The Motorcade",
    "content": [
      {
        "type": "paragraph",
        "text": "The problem wasn&#x27;t Brie’s capacity anymore. It was her attention."
      },
      {
        "type": "paragraph",
        "text": "As Brie&#x27;s team grew, she started more and more projects. All of them important. All of them competing for the same people, the same decisions, and the same slice of her attention."
      },
      {
        "type": "paragraph",
        "text": "Every project was slow. And Brie was exhausted—constantly switching context, spinning plates, and putting out fires."
      },
      {
        "type": "paragraph",
        "text": "“I feel like I&#x27;m running in every direction at once,” she said. “And I&#x27;m not getting anywhere.”"
      },
      {
        "type": "paragraph",
        "text": "She was right. The team was busy. Incredibly busy. Gridlocked."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "I asked her a question."
      },
      {
        "type": "paragraph",
        "text": "“When the president travels, how do they get across the city so fast?”"
      },
      {
        "type": "paragraph",
        "text": "She looked at me. “Motorcade?”"
      },
      {
        "type": "paragraph",
        "text": "“Right. They don&#x27;t make the car go faster. They clear the road. Stop the cross-traffic. Remove the obstacles. The car moves at normal speed—but nothing gets in its way.”"
      },
      {
        "type": "paragraph",
        "text": "She sat with that."
      },
      {
        "type": "paragraph",
        "text": "“So instead of trying to go faster …”"
      },
      {
        "type": "paragraph",
        "text": "“You clear the road.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "We started by cutting the number of active projects. Drastically."
      },
      {
        "type": "paragraph",
        "text": "This was hard. Every project was important. Every project had a sponsor, a business case, and a team who&#x27;d been working on it. Telling people to stop felt wrong."
      },
      {
        "type": "paragraph",
        "text": "But she did it anyway."
      },
      {
        "type": "paragraph",
        "text": "One or two priorities got the green light—the motorcade. Everything else could keep moving, but they had to stay out of the way. If the motorcade needed something—a decision, a resource, or Brie&#x27;s attention—it got priority. No exceptions."
      },
      {
        "type": "paragraph",
        "text": "“What do I tell the other teams?” Brie asked."
      },
      {
        "type": "paragraph",
        "text": "“Tell them they&#x27;re on hold. Tell them why. Tell them when you&#x27;ll come back to them.”"
      },
      {
        "type": "paragraph",
        "text": "“They won&#x27;t like it.”"
      },
      {
        "type": "paragraph",
        "text": "“They&#x27;ll like it better than being stuck in traffic forever.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The priority projects flew through. They delivered faster than anything had before."
      },
      {
        "type": "paragraph",
        "text": "But here&#x27;s what surprised us: more stuff got done overall, not less."
      },
      {
        "type": "paragraph",
        "text": "While building the motorcade, Brie and her team worked hard to remove obstacles—turning red traffic lights to green. Bottlenecks they’d been too busy to see. Decisions that had been waiting for months. Permissions that no one had thought to grant."
      },
      {
        "type": "paragraph",
        "text": "For Brie, personally and professionally, the relief was enormous. She didn&#x27;t have to spin dozens of plates anymore. She didn&#x27;t have to hold everything in her head. She could focus on what mattered most and trust that the rest was moving."
      },
      {
        "type": "paragraph",
        "text": "“I can actually think,” she told me. “I&#x27;d forgotten what that felt like.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Over time, the motorcade evolved into a priority lane—like the fast lane on a motorway, but not for emergencies. For the most important work. The VIP projects that the business needed most. They had a clear path, always. Everything else flowed at its own pace, giving way when needed."
      },
      {
        "type": "paragraph",
        "text": "Without this, none of the other changes would have stuck. Brie would still have been drowning—just with better-organized teams drowning alongside her."
      },
      {
        "type": "paragraph",
        "text": "The whole organization had become more aerodynamic. Shaped for speed. Not pushed."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "About three years in, Brie appeared on a video call one Friday evening. She was in Sydney. I was in New Zealand."
      },
      {
        "type": "paragraph",
        "text": "“Clarke,” she said. “You won&#x27;t believe it.”"
      },
      {
        "type": "paragraph",
        "text": "“Tell me.”"
      },
      {
        "type": "paragraph",
        "text": "“This morning I went to Pilates.”"
      },
      {
        "type": "paragraph",
        "text": "I waited. There had to be more."
      },
      {
        "type": "paragraph",
        "text": "She looked at me, expectant. Like I should be amazed."
      },
      {
        "type": "paragraph",
        "text": "“Clarke—don’t you remember what I told you when we first met?”"
      },
      {
        "type": "paragraph",
        "text": "I scrunched up my face, trying to remember."
      },
      {
        "type": "paragraph",
        "text": "She said, “I told you that I used to love Pilates, and I&#x27;ve been wanting to go back for over fifteen years. Fifteen years! But I&#x27;ve never had the time. This morning I went. And I didn&#x27;t check my emails first. And I didn’t check them when I got home. I showered, I had breakfast, and then—after breakfast—I finally checked my emails. It was 8:30 a.m., and I&#x27;d normally have been working two hours by then.”"
      },
      {
        "type": "paragraph",
        "text": "<em>Fifteen years</em>. She&#x27;d been so busy, so overwhelmed, that she couldn&#x27;t find one hour for herself. Not a holiday. Not a sabbatical. One hour."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what debottlenecking a leader actually looks like. Not just time to manage. <em>Time to think</em> creates <em>time to lead</em> creates <em>time to live</em>."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "When you debottleneck a leader, you&#x27;re not just making the business faster. You&#x27;re giving someone their life back."
      },
      {
        "type": "paragraph",
        "text": "Four years after we started, Brie (her real name was Angela) had a staff of over 400. The <em>Australian Financial Review</em> named her <em>Women in Leadership</em> winner for Tech and Telco in their annual awards."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what happens when you debottleneck the leader."
      }
    ]
  },
  {
    "title": "What Now?",
    "content": [
      {
        "type": "paragraph",
        "text": "You&#x27;ve just read a short book with a lot of ideas in it. Hourglasses and hermit crabs. Buses and motorcades. Rules of thumb and shells that no longer fit."
      },
      {
        "type": "paragraph",
        "text": "But really, it all comes down to one word: aerodynamic."
      },
      {
        "type": "paragraph",
        "text": "You need to shape your teams and your leaders for aerodynamics."
      },
      {
        "type": "paragraph",
        "text": "That’s how they go fast, in the right direction, without crashing into things."
      },
      {
        "type": "paragraph",
        "text": "<em>Welcome to the recombobulation zone.</em>"
      },
      {
        "type": "paragraph",
        "text": "<em>Let&#x27;s bring it all together.</em>"
      },
      {
        "type": "heading2",
        "text": "Below Is the Overarching Idea in This Book"
      },
      {
        "type": "paragraph",
        "text": "Every system has one bottleneck. Just one. That&#x27;s the theory."
      },
      {
        "type": "paragraph",
        "text": "<em>So why do so many teams have bottlenecks everywhere?</em>"
      },
      {
        "type": "paragraph",
        "text": "Because they have too many developers. When you try to run at the speed of the developers, everyone else scrambles to keep up. It&#x27;s like being a kid running downhill—legs going faster than they can carry you. You stumble. You fall. You skin your knees."
      },
      {
        "type": "paragraph",
        "text": "•\tAnalysts can&#x27;t feed their developers fast enough—bottleneck."
      },
      {
        "type": "paragraph",
        "text": "•\tTesters can&#x27;t give feedback fast enough—bottleneck."
      },
      {
        "type": "paragraph",
        "text": "•\tLeaders sacrifice their most important work—bottleneck."
      },
      {
        "type": "paragraph",
        "text": "They all become bottlenecks. Real bottlenecks. Real problems. All caused by one wrong shape."
      },
      {
        "type": "paragraph",
        "text": "Fix the shape, and they disappear."
      },
      {
        "type": "heading2",
        "text": "Part 1 Was for the People Closest to the Work"
      },
      {
        "type": "paragraph",
        "text": "Timer Teams. The hourglass shape. Developers in the middle—the deliberate bottleneck. Testers downstream with enough capacity to give fast feedback. Analysts upstream with enough time to think."
      },
      {
        "type": "paragraph",
        "text": "Two rules of thumb:"
      },
      {
        "type": "paragraph",
        "text": "1.\tCan your testers give fast feedback? If not, you need more testing capacity."
      },
      {
        "type": "paragraph",
        "text": "2.\tDo your analysts have time to think—without cutting corners? If not, you need more upstream capacity."
      },
      {
        "type": "paragraph",
        "text": "Your team probably already has the skills to figure this out. Once you see the shape, you&#x27;ll wonder why you didn&#x27;t see it before."
      },
      {
        "type": "heading2",
        "text": "Part 2 Was for the Managers"
      },
      {
        "type": "paragraph",
        "text": "Protect the shape. It&#x27;s not natural. It takes effort to maintain."
      },
      {
        "type": "paragraph",
        "text": "When things are going well, it&#x27;s tempting to relax. Move an analyst here. Skip a backfill there. Use up that spare capacity on something useful. All for good reasons."
      },
      {
        "type": "paragraph",
        "text": "But the natural state—the comfortable state—is for everyone to be equally busy. Fully utilized. No slack anywhere. And that&#x27;s exactly when the problems start."
      },
      {
        "type": "paragraph",
        "text": "A Timer Team doesn&#x27;t protect itself. You have to protect it."
      },
      {
        "type": "paragraph",
        "text": "Grow the bottleneck—but keep it as the bottleneck. Sometimes that means hiring a developer. Sometimes that means hiring an analyst first. Or a tester. Curate the work. Find simpler solutions. Watch the shape."
      },
      {
        "type": "paragraph",
        "text": "Don&#x27;t flip the hourglass by accident."
      },
      {
        "type": "heading2",
        "text": "Part 3 Was for the People Who Make Teams Work"
      },
      {
        "type": "paragraph",
        "text": "Scrum Masters, Tech Leads, coaches, and delivery managers. When you&#x27;re spread too thin, teams suffer. But no one notices—because you&#x27;re too good at coping."
      },
      {
        "type": "paragraph",
        "text": "And it&#x27;s not just you. It&#x27;s the leaders you work with. The senior people who set direction. When they&#x27;re overwhelmed, the whole organization runs in the wrong direction."
      },
      {
        "type": "paragraph",
        "text": "The lesson I learned from my personal trainer: pace the change. Keep slack in your calendar. Not laziness—flexibility. Room to respond. Room to think."
      },
      {
        "type": "paragraph",
        "text": "Sometimes the bottleneck is you—and that robs you of the ability to be a great leader. Fix it."
      },
      {
        "type": "heading2",
        "text": "Part 4 Was for the Leaders"
      },
      {
        "type": "paragraph",
        "text": "When the bottleneck is at the top, debottlenecking is more than time management. It&#x27;s learning to delegate. Learning to build teams. Learning to grow."
      },
      {
        "type": "paragraph",
        "text": "Hermit crabs leave their shells when they get too tight. They go naked for a moment—vulnerable, exposed—and dash into a bigger shell. Then they do it again. And again."
      },
      {
        "type": "paragraph",
        "text": "That&#x27;s what growth looks like. Uncomfortable. Necessary. And when you grow, the people below you have to grow too. The whole line cascades upward."
      },
      {
        "type": "paragraph",
        "text": "But growth isn&#x27;t enough if you&#x27;re drowning in projects. Clear the road. Build the motorcade. Protect your attention for what matters most."
      },
      {
        "type": "paragraph",
        "text": "Time to think. Time to lead. Time to live."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "In his classic bestselling book <em>Good to Great</em>, Jim Collins famously said: Get the right people on the bus, the wrong people off the bus, and the right people in the right seats."
      },
      {
        "type": "paragraph",
        "text": "Yeah, I know. More buses."
      },
      {
        "type": "paragraph",
        "text": "He was right. And I&#x27;d add one thing."
      },
      {
        "type": "paragraph",
        "text": "You also need the right mix of people on the bus. The right numbers. The right proportions. The right shape."
      },
      {
        "type": "paragraph",
        "text": "If you want your team to go fast—in the right direction—it needs to be shaped like an hourglass."
      },
      {
        "type": "paragraph",
        "text": "And if you want them to go even faster, don&#x27;t turn your good leaders into mediocre ones because they won&#x27;t have time to think, to lead, and to turn all the lights to green."
      },
      {
        "type": "paragraph",
        "text": "Two rules of thumb. One shape. Everything changes."
      },
      {
        "type": "paragraph",
        "text": "Aerodynamics, not horsepower. That&#x27;s the whole book."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "If any of this resonated—if you recognized your team in that bus, or yourself in Brie&#x27;s story—I&#x27;d be happy to talk."
      },
      {
        "type": "paragraph",
        "text": "clarke@clarkeching.com"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "P.S. If you want to see what happens when you can&#x27;t put developers at the bottleneck—when the rules don&#x27;t apply—turn the page to read the afterword. <strong>Some say it&#x27;s the best part of the book.</strong>"
      }
    ]
  },
  {
    "title": "Eve’s Story - Don’t Skip This",
    "content": [
      {
        "type": "paragraph",
        "text": "I need to make another confession."
      },
      {
        "type": "paragraph",
        "text": "Throughout this book, I’ve said that the developers should be the bottleneck. No exceptions. Timer Teams, hourglass shape, every time."
      },
      {
        "type": "paragraph",
        "text": "But I’ve been telling Eve’s story at conferences for years—and her team actually broke that rule."
      },
      {
        "type": "paragraph",
        "text": "<em>Why? What was different?</em>"
      },
      {
        "type": "paragraph",
        "text": "Everything I’ve told you so far assumes that you can choose where your bottleneck sits. Most teams can. You can hire more developers, or more testers, or more analysts. You can redistribute capacity. You can reshape."
      },
      {
        "type": "paragraph",
        "text": "But sometimes you can’t."
      },
      {
        "type": "paragraph",
        "text": "Eve’s team was an exception. They weren’t building new products—they were fixing regulatory bugs in ancient code. And their real bottleneck was testing—for reasons you’ll see shortly. There was no way to increase testing capacity. It was fixed. Immovable."
      },
      {
        "type": "paragraph",
        "text": "If Eve had made developers the bottleneck, her testers would have had spare capacity—which means they’d have done <em>less</em> testing. Total output would have dropped."
      },
      {
        "type": "paragraph",
        "text": "So she did the opposite. She accepted testing as the bottleneck and reshaped everything else around it."
      },
      {
        "type": "paragraph",
        "text": "It’s not a Timer Team. But the thinking is the same."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Several years ago, a CIO called Alfonzo asked me to speed up one of his software teams. He said the team was made up of the company’s oldest, cleverest, and gnarliest programmers, and their job was to fix the oldest, ugliest, and gnarliest bugs in their old, ugly, gnarly code base."
      },
      {
        "type": "paragraph",
        "text": "The team of 16 was trying to eliminate 112 regulatory defects. Alfonzo had promised his CEO they would get that number down to single figures by the end of the year."
      },
      {
        "type": "paragraph",
        "text": "It was late April, so they had just over eight months left."
      },
      {
        "type": "paragraph",
        "text": "“They need to get through at least thirteen a month,” he said. “They’re currently doing ten. That’s a 30 percent bump in productivity.”"
      },
      {
        "type": "paragraph",
        "text": "I asked if he had a backup plan."
      },
      {
        "type": "paragraph",
        "text": "“I’ve got a big project wrapping up in September. If I need to, I’ll move six of my best programmers onto these bug fixes.”"
      },
      {
        "type": "paragraph",
        "text": "More developers. The obvious solution. I nodded and went to meet the team."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Their manager, Eve, showed me around. When I asked to see their defect tracking system, she pointed behind me to three whiteboards covered in yellow stickies—one for each defect."
      },
      {
        "type": "paragraph",
        "text": "“You said you have two testers. Where’s their board?”"
      },
      {
        "type": "paragraph",
        "text": "“They have their own board, around the corner.”"
      },
      {
        "type": "paragraph",
        "text": "“How come?”"
      },
      {
        "type": "paragraph",
        "text": "“Once upon a time, the testers’ stickies used to fit on the third board along with the programmers’. But the testers couldn’t keep up, so I got them a new board. It would block the walkway if we placed it next to the others.”"
      },
      {
        "type": "paragraph",
        "text": "She wheeled out the fourth board and placed it beside the others."
      },
      {
        "type": "paragraph",
        "text": "The four boards showed the team’s entire process. Each defect went through four steps: Analysis, Design, Programming, and Testing. What struck me was where all the work was stuck."
      },
      {
        "type": "paragraph",
        "text": "The testers’ board was packed. I stepped closer and noticed the stickies were grouped into three clumps: one huge, one small, and one medium."
      },
      {
        "type": "paragraph",
        "text": "Eve explained: “The big clump on the left—those have been fixed by the programmers and are waiting to be tested. The small clump is currently being tested. The medium clump has been tested and is waiting to be shipped.”"
      },
      {
        "type": "paragraph",
        "text": "I counted roughly forty stickies in that big clump on the left. At ten defects a month, that was four months of work just sitting there, waiting."
      },
      {
        "type": "paragraph",
        "text": "I drew an imaginary red circle around it in my mind and labeled it the Waiting Room."
      },
      {
        "type": "paragraph",
        "text": "“That big clump reminds me of patients sitting in a hospital waiting room,” I said."
      },
      {
        "type": "paragraph",
        "text": "Eve snorted. “If it were a waiting room, they’d all be dead by now. Died of boredom.” She plucked one sticky from the pile, turned it over, and blanched. “The programmers started working on this defect fourteen months ago.”"
      },
      {
        "type": "paragraph",
        "text": "“Fourteen months?!”"
      },
      {
        "type": "paragraph",
        "text": "“It’s easy. The programmer takes two weeks to fix it. As soon as they’re finished, it moves to the testers’ board, where it sits in the Waiting Room for a few months. When the testers finally look at it, they discover that it’s mostly fixed but not completely. So it goes back to the programmers’ board, where it waits again. When the programmer becomes free, they fix it again, and it goes back to the Waiting Room for another few months.”"
      },
      {
        "type": "paragraph",
        "text": "She grimaced. “Do you see where this is going?”"
      },
      {
        "type": "paragraph",
        "text": "I did. For most of those fourteen months, the defect was just sitting around waiting to be worked on."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "The testers were the bottleneck. They couldn’t keep up with the rest of the team. But because everyone else kept working at full speed, they’d created that enormous Waiting Room—and ridiculous delays."
      },
      {
        "type": "paragraph",
        "text": "I asked Eve if there was any way to get more testing capacity."
      },
      {
        "type": "paragraph",
        "text": "She shook her head. “Our two testers are already working as efficiently as possible. They’ve cut every ounce of fat they can find. Neither has had any training in the past two years. They never attend their test-team meetings. They cannot do any more.”"
      },
      {
        "type": "paragraph",
        "text": "“What about recruiting?”"
      },
      {
        "type": "paragraph",
        "text": "“Our old, clunky system is staggeringly difficult to learn. Whenever someone new joins, my existing testers slow down enormously because they have to teach them. It takes months and months to get up to speed. There are only four testers in the whole company with the depth of knowledge we need, and their managers won’t release them.”"
      },
      {
        "type": "paragraph",
        "text": "She folded her arms. “So there you go.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "A week later, I met with Eve and her entire team in the boardroom. We’d carried the four whiteboards up—it took two elevator trips."
      },
      {
        "type": "paragraph",
        "text": "I explained the bottleneck situation. Eyes glazed over. So I changed tack."
      },
      {
        "type": "paragraph",
        "text": "“Have you guys heard the buffalo joke?”"
      },
      {
        "type": "paragraph",
        "text": "It&#x27;s an old joke—an imagined conversation between Norm and Cliff from the TV sitcom <em>Cheers</em>."
      },
      {
        "type": "paragraph",
        "text": "The gist: a herd of buffalo can only move as fast as its slowest member. When wolves hunt them, they pick off the weakest at the back. This makes the herd faster and stronger."
      },
      {
        "type": "paragraph",
        "text": "“In much the same way,” Cliff explains, “the human brain can only operate as fast as the slowest brain cells. And as we know, alcohol attacks the weakest brain cells first. So, regular beer consumption eliminates the weaker brain cells, making the brain faster and more efficient. And that, Norm, is why you always feel smarter after a few beers.”"
      },
      {
        "type": "paragraph",
        "text": "There was a burst of laughter. Then everyone looked around, smiling at each other. Then they turned back to face me, clearly wondering why I’d just told them this silly story."
      },
      {
        "type": "paragraph",
        "text": "I asked: “Do you folks have a slowest buffalo in your team?”"
      },
      {
        "type": "paragraph",
        "text": "All eyes turned to the two testers, Lawrence and Anne, sitting at the end of the table."
      },
      {
        "type": "paragraph",
        "text": "Anne said tentatively, “Obviously, it’s us, right?”"
      },
      {
        "type": "paragraph",
        "text": "One of the senior developers, Peter, chuckled. “Does that mean we should feed you two to the wolves?”"
      },
      {
        "type": "paragraph",
        "text": "Everyone laughed—including the testers."
      },
      {
        "type": "paragraph",
        "text": "Then Peter turned serious. “I know you’re both working really hard, but is there anything—anything at all—you can think of that might help you speed up, even a little bit?”"
      },
      {
        "type": "paragraph",
        "text": "Lawrence shook his head. “We’ve been asking ourselves that for months.”"
      },
      {
        "type": "paragraph",
        "text": "But Anne said, “Actually, there is one thing. You guys keep interrupting us to ask questions about the defects you’re working on. That takes time away from testing, and after we’ve helped you, it takes us a few minutes to get back up to speed. If we weren’t interrupted so much, I bet we’d gain half an hour back each day.”"
      },
      {
        "type": "paragraph",
        "text": "Peter frowned. “But if we don’t ask you for help, we can’t finish our work.”"
      },
      {
        "type": "paragraph",
        "text": "The team’s designer, Gloria, spoke up. “Isn’t that the other point of the buffalo joke? The faster buffalo needs to slow down and run at the speed of the slower buffalo. Otherwise, the herd splits apart.”"
      },
      {
        "type": "paragraph",
        "text": "Silence."
      },
      {
        "type": "paragraph",
        "text": "They’d been trying to fix their problem by having everyone work harder. Now they were realizing that the faster buffalo needed to slow down."
      },
      {
        "type": "paragraph",
        "text": "Eve spoke. “I’m going to make this easy. Starting now, no one works on any stickies unless they’re already on the testing board. There’s at least three months’ work there. Those defects are our only priority. Don’t start anything new.”"
      },
      {
        "type": "paragraph",
        "text": "One programmer protested: “But we can’t just sit there doing nothing!”"
      },
      {
        "type": "paragraph",
        "text": "Peter said, “We don’t have to twiddle our thumbs. Some defects will fail testing, and we’ll need to fix them. And …” He turned to the testers. “Are there any ways we could help you out?”"
      },
      {
        "type": "paragraph",
        "text": "Lawrence thought for a moment. “You could type in some of our test data. That takes us ages.”"
      },
      {
        "type": "paragraph",
        "text": "Another programmer shook his head. “I’m not doing manual data entry. We’re programmers—we automate things like that. We’ve got scripts written that you could use.”"
      },
      {
        "type": "paragraph",
        "text": "Lawrence stared at him. “You’ve got scripts?”"
      },
      {
        "type": "paragraph",
        "text": "“Of course. Hasn’t anyone ever shown you?”"
      },
      {
        "type": "paragraph",
        "text": "“No!”"
      },
      {
        "type": "paragraph",
        "text": "“I guess we’ve been too busy.” The programmer paused. “I can customize and run them for you. It’ll save you a load of time.”"
      },
      {
        "type": "paragraph",
        "text": "The conversation kept going. The programmers offered to take over environment management so the testers could focus on testing. The analysts offered to sort through the Waiting Room and group similar defects into batches. The designer offered to identify which defects would be hardest to test, so they could leave those for last."
      },
      {
        "type": "paragraph",
        "text": "By the end of the meeting, the whole team was working differently."
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Almost a year later, Eve and I had lunch together."
      },
      {
        "type": "paragraph",
        "text": "“We fixed and tested 106 of the 112 defects,” she said. “Hit Alfonzo’s target. We bumped our throughput by a little over 30 percent without spending a penny.”"
      },
      {
        "type": "paragraph",
        "text": "“Brilliant!”"
      },
      {
        "type": "paragraph",
        "text": "“A year ago, it used to take over ten months from when an analyst first looked at a defect to when we shipped it. Now it’s down to five weeks.”"
      },
      {
        "type": "paragraph",
        "text": "“Fantastic!”"
      },
      {
        "type": "paragraph",
        "text": "“And remember how Alfonzo promised to lend us six developers if we needed them?”"
      },
      {
        "type": "paragraph",
        "text": "I nodded."
      },
      {
        "type": "paragraph",
        "text": "She chuckled. “Turns out we had too many programmers. I reduced my headcount and gave three to projects that could use them. So not only did our throughput jump by a third, but my budget dropped by 15 percent.”"
      },
      {
        "type": "paragraph",
        "text": "I asked if testing was still her bottleneck."
      },
      {
        "type": "paragraph",
        "text": "She frowned. “Of course. Where else would it be? We keep a few stickies in the testers’ fuel tank, ready for testing. Not too many, not too few. We couldn’t do that if our programmers were the bottleneck.”"
      },
      {
        "type": "paragraph",
        "text": "She smiled."
      },
      {
        "type": "paragraph",
        "text": "“My team is calmer, happier, smaller, and faster than we’ve ever been.”"
      },
      {
        "type": "separator"
      },
      {
        "type": "paragraph",
        "text": "Eve’s team wasn’t a Timer Team. They couldn’t be. But they used the same thinking: find the real bottleneck, stop fighting it, and reshape everything else to support it."
      },
      {
        "type": "paragraph",
        "text": "Remember Alfonzo’s backup plan? Six more developers. The obvious solution."
      },
      {
        "type": "paragraph",
        "text": "It would have been a disaster."
      },
      {
        "type": "paragraph",
        "text": "Eve’s team didn’t have a developer shortage. They had a developer <em>surplus</em>. All those programmers churning out fixes that piled up in the Waiting Room, sitting there for months. Adding six more would have made the pile bigger and the delays longer."
      },
      {
        "type": "paragraph",
        "text": "The problem wasn’t too few developers. It was too many—relative to their immovable testing capacity."
      },
      {
        "type": "paragraph",
        "text": "Once Eve saw that, she did the counterintuitive thing: she slowed the developers down, used their spare capacity to help the testers, and eventually gave three of them back to other projects."
      },
      {
        "type": "paragraph",
        "text": "Fewer developers. More output. Lower costs. Faster team."
      },
      {
        "type": "paragraph",
        "text": "Sometimes the answer isn’t more. It’s less—but in the right shape."
      }
    ]
  }
]
